[{"text":"So there is no way for me to plug it in here in the US unless I go by a converter.","class":0},{"text":"Good case, Excellent value.","class":1},{"text":"Great for the jawbone.","class":1},{"text":"Tied to charger for conversations lasting more than 45 minutes.MAJOR PROBLEMS!!","class":0},{"text":"The mic is great.","class":1},{"text":"I have to jiggle the plug to get it to line up right to get decent volume.","class":0},{"text":"If you have several dozen or several hundred contacts, then imagine the fun of sending each of them one by one.","class":0},{"text":"If you are Razr owner...you must have this!","class":1},{"text":"Needless to say, I wasted my money.","class":0},{"text":"What a waste of money and time!.","class":0},{"text":"And the sound quality is great.","class":1},{"text":"He was very impressed when going from the original battery to the extended battery.","class":1},{"text":"If the two were seperated by a mere 5+ ft I started to notice excessive static and garbled sound from the headset.","class":0},{"text":"Very good quality though","class":1},{"text":"The design is very odd, as the ear \"clip\" is not very comfortable at all.","class":0},{"text":"Highly recommend for any one who has a blue tooth phone.","class":1},{"text":"I advise EVERYONE DO NOT BE FOOLED!","class":0},{"text":"So Far So Good!.","class":1},{"text":"Works great!.","class":1},{"text":"It clicks into place in a way that makes you wonder how long that mechanism would last.","class":0},{"text":"I went on Motorola's website and followed all directions, but could not get it to pair again.","class":0},{"text":"I bought this to use with my Kindle Fire and absolutely loved it!","class":1},{"text":"The commercials are the most misleading.","class":0},{"text":"I have yet to run this new battery below two bars and that's three days without charging.","class":1},{"text":"I bought it for my mother and she had a problem with the battery.","class":0},{"text":"Great Pocket PC / phone combination.","class":1},{"text":"I've owned this phone for 7 months now and can say that it's the best mobile phone I've had.","class":1},{"text":"I didn't think that the instructions provided were helpful to me.","class":0},{"text":"People couldnt hear me talk and I had to pull out the earphone and talk on the phone.","class":0},{"text":"Doesn't hold charge.","class":0},{"text":"This is a simple little phone to use, but the breakage is unacceptible.","class":0},{"text":"This product is ideal for people like me whose ears are very sensitive.","class":1},{"text":"It is unusable in a moving car at freeway speed.","class":0},{"text":"I have two more years left in this contract and I hate this phone.","class":0},{"text":"Car charger as well as AC charger are included to make sure you never run out of juice.Highy recommended","class":1},{"text":"You need at least 3 mins to get to your phone book from the time you first turn on the phone.Battery life is short.","class":0},{"text":"It has kept up very well.","class":1},{"text":"Poor Talk Time Performance.","class":0},{"text":"The case is great and works fine with the 680.","class":1},{"text":"worthless product.","class":0},{"text":"It has a great camera thats 2MP, and the pics are nice and clear with great picture quality.","class":1},{"text":"I was not impressed by this product.","class":0},{"text":"Nice headset priced right.","class":1},{"text":"I only hear garbage for audio.","class":0},{"text":"Excellent bluetooth headset.","class":1},{"text":"It has all the features I want","class":1},{"text":"Who in their right mind is gonna buy this battery?.","class":0},{"text":"AFTER ARGUING WITH VERIZON REGARDING THE DROPPED CALLS WE RETURNED THE PHONES AFTER TWO DAYS.","class":0},{"text":"This case seems well made.","class":1},{"text":"Disappointed with battery.","class":0},{"text":"Not loud enough and doesn't turn on like it should.","class":0},{"text":"good protection and does not make phone too bulky.","class":1},{"text":"A usable keyboard actually turns a PDA into a real-world useful machine instead of just a neat gadget.","class":1},{"text":"This phone is pretty sturdy and I've never had any large problems with it.","class":1},{"text":"I love this thing!","class":1},{"text":"Everything about it is fine and reasonable for the price i.e.","class":1},{"text":"VERY DISAPPOINTED.","class":0},{"text":"I even dropped this phone into a stream and it was submerged for 15 seconds and it still works great!","class":1},{"text":"I have been very happy with the 510 and have had NO complaints from any one regarding my sound quality on their end.","class":1},{"text":"The buttons for on and off are bad.","class":0},{"text":"Essentially you can forget Microsoft's tech support.","class":0},{"text":"I really recommend this faceplates since it looks very nice, elegant and cool.","class":1},{"text":"These headphones were a great find - and I think they are perhaps the best purchase I've made in the last several years - seriously.","class":1},{"text":"Buy a different phone - but not this.","class":0},{"text":"You have to hold the phone at a particular angle for the other party to hear you clearly.","class":0},{"text":"The one big drawback of the MP3 player is that the buttons on the phone's front cover that let you pause and skip songs lock out after a few seconds.","class":0},{"text":"A week later after I activated it, it suddenly died.","class":0},{"text":"It feels more comfortable than most headsets because I wear glasses and that gets in the way sometimes.","class":1},{"text":"Great for iPODs too.","class":1},{"text":"This device is great in several situations:1.)","class":1},{"text":"Mic Doesn't work.","class":0},{"text":"Even in my BMW 3 series which is fairly quiet, I have trouble hearing what the other person is saying.","class":0},{"text":"Great choice!","class":1},{"text":"Nice docking station for home or work.","class":1},{"text":"This is a beautiful phone.","class":1},{"text":"Love this product.","class":1},{"text":"Do Not Buy for D807...wrongly advertised for D807.","class":0},{"text":"This is a great little item.","class":1},{"text":"I love this phone , It is very handy and has a lot of features .","class":1},{"text":"I purchased this and within 2 days it was no longer working!!!!!!!!!","class":0},{"text":"I wear it everyday and it holds up very well.","class":1},{"text":"Not a good bargain.","class":0},{"text":"Well packaged, arrived on time, and works as intended.","class":1},{"text":"The battery runs down quickly.","class":0},{"text":"This item worked great, but it broke after 6 months of use.","class":0},{"text":"The headsets are easy to use and everyone loves them.","class":1},{"text":"This phone works great.","class":1},{"text":"The construction of the headsets is poor.","class":0},{"text":"Product was excellent and works better than the verizon one and Boy was it cheaper!","class":1},{"text":"The phone loads super!","class":1},{"text":"For a product that costs as much as this one does, I expect it to work far better and with greater ease than this thing does.","class":0},{"text":"Made very sturdy.","class":1},{"text":"Worked great!.","class":1},{"text":"The ear buds only play music in one ear.","class":0},{"text":"Dont waste your money...","class":0},{"text":"Will order from them again!","class":1},{"text":"If you plan to use this in a car forget about it.","class":0},{"text":"I found this product to be waaay too big.","class":0},{"text":"Best I've found so far .... I've tried 2 other bluetooths and this one has the best quality (for both me and the listener) as well as ease of using.","class":1},{"text":"I'm very disappointed with my decision.","class":0},{"text":"Integrated seamlessly with the Motorola RAZR phone.","class":1},{"text":"Buyer Beware, you could flush money right down the toilet.","class":0},{"text":"Definitely a bargain.","class":1},{"text":"The price was very good and with the free shipping and all it was a good purchase.","class":1},{"text":"I received my supposedly new motorola 375 and apparently there was not a match between the phone and the charger.","class":0},{"text":"Pros:-Good camera - very nice pictures , also has cool styles like black and white, and more.","class":1},{"text":"That's a huge design flaw (unless I'm not using it correctly, which I don't think is the case).","class":0},{"text":"I love my 350 headset.. My Jabra350 bluetooth headset is great, the reception is very good and the ear piece is a comfortable fit.","class":1},{"text":"The camera, although rated at an impressive 1.3 megapixels, renders images that fall well below expectations of such a relatively high resolution.","class":0},{"text":"I purcashed this for the car charger and it does not work.","class":0},{"text":"Sound quality on both end is excellent, I use headset to call my wife and ask my wife to use headset to call me !2.","class":1},{"text":"This phone is slim and light and the display is beautiful.","class":1},{"text":"its a little geeky but i think thats its sex on toast and it rocks and oozes sex right down to its battery embedded sleek stylish leather case.","class":1},{"text":"Great product, fast shipping!.","class":1},{"text":"Absolutely great.","class":1},{"text":"The keyboard is a nice compromise between a full QWERTY and the basic cell phone number keypad.","class":1},{"text":"i got this phone around the end of may and i'm completely unhappy with it.","class":0},{"text":"It is very comfortable on the ear.","class":1},{"text":"It has been a winner for us.","class":1},{"text":")Setup couldn't have been simpler.","class":1},{"text":"I've tried several different earpieces for my cell phone and this Jabra one is the first one I've found that fits my ear comfortably.","class":1},{"text":"Could not get strong enough signal.","class":0},{"text":"Iam very pleased with my purchase.","class":1},{"text":"Bad Quality.","class":0},{"text":"Gets the job done.","class":1},{"text":"Great audio!.","class":1},{"text":"Basically the service was very bad.","class":0},{"text":"it did not work in my cell phone plug i am very up set with the charger!.","class":0},{"text":"I've only had my bluetooth for a few weeks, but I really like it.","class":1},{"text":"The BT headset was such a disapoinment.","class":0},{"text":"It is so small and you don't even realize that it is there after a while of getting used to it.","class":1},{"text":"The accompanied software is almost brilliant.","class":1},{"text":"Headset works great & was packaged nicely to avoid any damage.","class":1},{"text":"!I definitly recommend!!","class":1},{"text":"Buyer--Be Very Careful!!!!!.","class":0},{"text":"The majority of the Logitech earbud headsets failed.","class":0},{"text":"Very good stuff for the price.","class":1},{"text":"My headset works just peachy-keen.","class":1},{"text":"In my house I was getting dropped coverage upstairs and no coverage in my basement.","class":0},{"text":"Voice recognition is tremendous!","class":1},{"text":"What a waste.","class":0},{"text":"During several different 2 minute calls, I experienced 5 drops and it was in an area that had 5 bars.","class":0},{"text":"I was not happy with this item.","class":0},{"text":"very disappointed.","class":0},{"text":"The phone takes FOREVER to charge like 2 to 5 hours literally.","class":0},{"text":"I got this phone on reccomendation from a relative and I'm glad I did.","class":1},{"text":"What a waste of time!","class":0},{"text":"Its reception is very very poor.","class":0},{"text":"Items stated as included from the description ARE NOT INCLUDED.","class":0},{"text":"After 3 months, screen just went black all of a sudden.","class":0},{"text":"I Was Hoping for More.","class":0},{"text":"Audio Quality is poor, very poor.","class":0},{"text":"I had absolutely no problem with this headset linking to my 8530 Blackberry Curve!","class":1},{"text":"I know that sounds funny, but to me it seemed like sketchy technology that wouldn't work well.Well, this one works great.","class":1},{"text":"I've bought $5 wired headphones that sound better than these.","class":0},{"text":"This phone is very fast with sending any kind of messages and web browsing is significantly faster than previous phones i have used.","class":1},{"text":"Nice quality build, unlike some cheap s*** out there.","class":1},{"text":"This item is fantastic and works perfectly!","class":1},{"text":"And I just love the colors!","class":1},{"text":"W810i is just SUPERB.","class":1},{"text":"All I can do is whine on the Internet, so here it goes.The more I use the thing the less I like it.","class":0},{"text":"Great charger.","class":1},{"text":"This is essentially a communications tool that does not communicate.","class":0},{"text":"Works like a charm; it work the same as the one I got with the phone.","class":1},{"text":"I still maintain that monkeys shouldn't make headphones, we just obviously don't share enough DNA to copy the design over to humans.","class":0},{"text":"Great Value.","class":1},{"text":"Doesn't work at all.. I bougth it for my L7c and its not working.","class":0},{"text":"The look of it is very sharp and the screen is nice and clear, with great graphics.","class":1},{"text":"doesn't last long.","class":0},{"text":"One thing I hate is the mode set button at the side.","class":0},{"text":"EXCELLENT SERVICE!!!!!!!!.","class":1},{"text":"Thank you for wasting my money.","class":0},{"text":"How can that be?The audio quality is poor.","class":0},{"text":"The iGo chargers and tips are really great.","class":1},{"text":"The file browser offers all the options that one needs.Handsfree is great.","class":1},{"text":"Superb Phone on a Great Network.","class":1},{"text":"I connected my wife's bluetooth,(Motorola HS850) to my phone and it worked like a charm whether the phone was in my pocket or the case.","class":1},{"text":"I put the latest OS on it (v1.15g), and it now likes to slow to a crawl and lock up every once in a while.","class":0},{"text":"It only recognizes the Phone as its storage device.","class":0},{"text":"If you like a loud buzzing to override all your conversations, then this phone is for you!","class":0},{"text":"Don't buy this product.","class":0},{"text":"I've had this bluetoooth headset for some time now and still not comfortable with the way it fits on the ear.","class":0},{"text":"The sound quality is good and functionality is awesome.","class":1},{"text":"I have this phone and it is a thorn in my side, I really abhor it.","class":0},{"text":"I recently had problems where I could not stay connected for more than 10 minutes before being disconnected.","class":0},{"text":"Incredible!.","class":1},{"text":"Design Flaw?.","class":0},{"text":"Great phone!.","class":1},{"text":"Waste of 13 bucks.","class":0},{"text":"But when I check voice mail at night, the keypad backlight turns off a few seconds into the first message, and then I'm lost.","class":0},{"text":"The replacement died in a few weeks.","class":0},{"text":"Any ring tone..Overall good phone to buy..","class":1},{"text":"Lately they have been extremely nice and helpful on the phone.","class":1},{"text":"I have had problems wit hit dropping signal and more.","class":0},{"text":"Not impressed.","class":0},{"text":"Light weight, I hardly notice it is there.","class":1},{"text":"You'll love how thin it is.","class":1},{"text":"Bad Choice.","class":0},{"text":"The pleather case doesn't fit.","class":0},{"text":"useless phone, simply deaf.","class":0},{"text":"The color is even prettier than I thought it would be, and the graphics are incredibly sharp.","class":1},{"text":"All in all I think it was a good investment.","class":1},{"text":"It makes very strange ticking noises before it ends the call.","class":0},{"text":"The best electronics of the available FM Transmitters.","class":1},{"text":"Battery lasts only a few hours.","class":0},{"text":"great headset, very impressed - H500.","class":1},{"text":"The \"1.2\" mega pixel camera, being a part of a phone, is reasonably good7.","class":1},{"text":"I've had this for nearly 2 years and it has worked great for me.","class":1},{"text":"Good transmit audio.","class":1},{"text":"We are sending it back.","class":0},{"text":"I did not bother contacting the company for few dollar product but I learned the lesson that I should not have bought this form online anyway.","class":0},{"text":"If you hate earbugs, avoid this phone by all means.","class":0},{"text":"Great price also!","class":1},{"text":"The range is very decent, I've been able to roam around my house with the phone in the living room with no reception/sound quality issues.","class":1},{"text":"fast service.","class":1},{"text":"I would highly recommend this.","class":1},{"text":"I would recommend this.","class":1},{"text":"I also didn't like the \"on\" button, it felt like it would crack with use.","class":0},{"text":"WORST PHONE EVER.","class":0},{"text":"I'm still infatuated with this phone.","class":1},{"text":"Freezes frequently4.","class":0},{"text":"It's kind of embarrassing to use because of how it looks and mostly it's embarrassing how child-like the company is.","class":0},{"text":"Simple, lightweight and great fit.","class":1},{"text":"All in all, I'd expected a better consumer experience from Motorola.","class":0},{"text":"There's a horrible tick sound in the background on all my calls that I have never experienced before.","class":0},{"text":"These are certainly very comfortable and functionality is decent.","class":1},{"text":"I usually don't like headbands but this one is very lightweight & doesn't mess up my hair.","class":1},{"text":"I'm a bit disappointed.","class":0},{"text":"I have had this phone for over a year now, and I will tell you, its not that great.","class":0},{"text":"I ordered this for sony Ericsson W810i but I think it only worked once (thats when I first used it).","class":0},{"text":"The battery is completely useless to me.","class":0},{"text":"What a big waste of time.","class":0},{"text":"Don't waste your $$$ on this one.","class":0},{"text":"Great sound and service.","class":1},{"text":"Really pleased with this product so far.","class":1},{"text":"One of my favorite purchases ever.","class":1},{"text":"best bluetooth on the market.","class":1},{"text":"Authentic leather with nice shine and comfort .I recommend you this case !!","class":1},{"text":"I was very excited to get this headset because I thought it was really cute.","class":1},{"text":"Do not make the same mistake as me.","class":0},{"text":"Big Disappointment with calendar sync.","class":0},{"text":"the phone was unusable and was not new.","class":0},{"text":"Worst Customer Service Ever.","class":0},{"text":"No additional ear gels provided, and no instructions whatsoever.","class":0},{"text":"It defeats the purpose of a bluetooth headset.","class":0},{"text":"Worth every penny.","class":1},{"text":"Excellent wallet type phone case.","class":1},{"text":"Nice headphones for the price and they work great!","class":1},{"text":"Internet is excrutiatingly slow.","class":0},{"text":"It is very comfortable to wear as well, which is probably the most important aspect about using a case.","class":1},{"text":"It's fits like a glove and is strong, secure, and durable.","class":1},{"text":"O my gosh the best phone I have ever had.","class":1},{"text":"It's very attractive and appears to be of good quality.","class":1},{"text":"I love all the features and form factor.","class":1},{"text":"This product had a strong rubber/petroleum smell that was unbearable after a while and caused me to return it","class":0},{"text":"poor quality and service.","class":0},{"text":"The cable looks so thin and flimsy, it is scary.","class":0},{"text":"Great Earpiece.","class":1},{"text":"Excellent hands free tool.","class":1},{"text":"Great for using with your home stereo.","class":1},{"text":"Good product - incredible value.","class":1},{"text":"Only had this a month but it's worked flawlessly so far.","class":1},{"text":"Works great.","class":1},{"text":"Absolutel junk.","class":0},{"text":"THAT one didn't work either.","class":0},{"text":"Battery life is real good.","class":1},{"text":"Returned 8 hours later.","class":0},{"text":"It's a great item.","class":1},{"text":"Don't waste your money!.","class":0},{"text":"Love this headset!","class":1},{"text":"Not only will it drain your player, but may also potentially fry it.","class":0},{"text":"Worked perfectly!","class":1},{"text":"Unreliable - I'm giving up.","class":0},{"text":"I gave it 5 stars because of the sound quality.","class":1},{"text":"Avoid this one if you can.","class":0},{"text":"Reversible plug works great.","class":1},{"text":"I wasted my little money with this earpiece.","class":0},{"text":"Very good phone.","class":1},{"text":"Best of all is the rotating feature, very helpful.","class":1},{"text":"Comfort for our whole family.","class":1},{"text":"Good product, good seller.","class":1},{"text":"I love this bluetooth!","class":1},{"text":"First of all, it doesn't wear well.","class":0},{"text":"I am very impressed with this headset from Plantronics.","class":1},{"text":"I got it because it was so small and adorable.","class":1},{"text":"Great phone!.","class":1},{"text":"I wouldn't recommend buying this product.","class":0},{"text":"Piece of Junk.","class":0},{"text":"Poorly contstruct hinge.","class":0},{"text":"This item is great, installed it, let it charged up overnite and it has been working good every since with no problems","class":1},{"text":"Great Phone.","class":1},{"text":"Don't buy it.","class":0},{"text":"Excellent Phone.","class":1},{"text":"DO NOT PURCHASE THIS PHONE.","class":0},{"text":"The voice recognition thru the handset is excellent.","class":1},{"text":"This is hands down the best phone I've ever had.","class":1},{"text":"Works great, when my cat attacked the phone he scratched the protective strip instead of destroying the screen.","class":1},{"text":"This one works and was priced right.","class":1},{"text":"Customer service was terrible.","class":0},{"text":"Battery life still not long enough in Motorola Razor V3i.","class":0},{"text":"Sending it back.","class":0},{"text":"Now I know that I made a wise decision.","class":1},{"text":"Someone shouldve invented this sooner.","class":1},{"text":"Good price.","class":1},{"text":"Everything worked on the first try.The device was certainly engineered in a clever way and the construction feels good.","class":1},{"text":"I received it quickly and it works great!!","class":1},{"text":"Has been working great.","class":1},{"text":"As many people complained, I found this headset's microphone was very weak.","class":0},{"text":"My 5-year old Nokia 2160 from Tracfone holds the charge a lot better than this.","class":0},{"text":"They do not care about the consumer one bit.","class":0},{"text":"This is a good battery, and it got here really fast.","class":1},{"text":"The instruction manual is lacking.","class":0},{"text":"Also its slim enough to fit into my alarm clock docking station without removing the case.","class":1},{"text":"Phone now holds charge like it did when it was new.","class":1},{"text":"The battery is unreliable as well as the service use antena.","class":0},{"text":"It's uncomfortable and the sound quality is quite poor compared with the phone (Razr) or with my previous wired headset (that plugged into an LG).","class":0},{"text":"We have gotten a lot of compliments on it.","class":1},{"text":"This is definitely a must have if your state does not allow cell phone usage while driving.","class":1},{"text":"I want my money back.","class":0},{"text":"I love this device.","class":1},{"text":"I am also very happy with the price.","class":1},{"text":"I ordered this product first and was unhappy with it immediately.","class":0},{"text":"The Ngage is still lacking in earbuds.","class":0},{"text":"I was able to do voice dialing in the car with no problem.","class":1},{"text":"I have 2-3 bars on my cell phone when I am home, but you cant not hear anything.","class":0},{"text":"good item, low price.","class":1},{"text":"However-the riingtones are not the best, and neither are the games.","class":0},{"text":"The plug did not work very well.","class":0},{"text":"AMAZON SUCKS.","class":0},{"text":"Rip off---- Over charge shipping.","class":0},{"text":"VERY comfortable.","class":1},{"text":"The battery is working well as a replacement for the original that came with the phone over 2 years ago.","class":1},{"text":"The reception is excellent!","class":1},{"text":"It fits comfortably in either ear, the sound is clear and loud, and the charge lasts a couple of days.","class":1},{"text":"very clear, quality sound and you don't have to mess with the sound on your iPod since you have the sound buttons on the headset.","class":1},{"text":"1. long lasting battery (you don't have to recharge it as frequentyly as some of the flip phones)2.","class":0},{"text":"Obviously there is a problem with the adhesive.","class":0},{"text":"Very disappointing.","class":0},{"text":"It was an inexpensive piece, but I would still have expected better quality.","class":0},{"text":"It is practically useless and did not add any kind of boost to my reception after I bought it.","class":0},{"text":"Excellent sound quality.","class":1},{"text":"Was not happy.","class":0},{"text":"A PIECE OF JUNK THAT BROKE AFTER BEING ON MY PHONE FOR 2 DAYS!!!","class":0},{"text":"New Battery works great in phone.","class":1},{"text":"Worst customer service.","class":0},{"text":"I've dropped my phone more times than I can say, even on concrete and my phone is still great (knock on wood!).","class":1},{"text":"Reception is terrible and full of static.","class":0},{"text":"Good audio quality.","class":1},{"text":"This little device has transformed my organizational capability and made my life a whole lot easier.","class":1},{"text":"I was sitting in my vehicle, with the cradle on my belt, and the headset lost signal.","class":0},{"text":"Were JERKS on the phone.","class":0},{"text":"Works like a charm.. Works as advertised.","class":1},{"text":"Comfortable, Nice Range, Good Battery Life.","class":1},{"text":"Their network coverage in Los Angeles is horrible.","class":0},{"text":"Excellent starter wireless headset.","class":0},{"text":"The loudspeaker option is great, the bumpers with the lights is very ... appealing.","class":0},{"text":"The only thing that I think could improve is the sound leaks out from the headset.","class":0},{"text":"First off the reception sucks, I have never had more than 2 bars, ever.","class":0},{"text":"The phone gets EXTREMELY HOT!","class":0},{"text":"The microphone also works well, but (according to people I have called) it applifies everything.","class":1},{"text":"Nice design and quality.","class":1},{"text":"Also, if your phone is dropped, this case is not going to save it, specially when dropped face down.","class":0},{"text":"It is light, easy to use, and has very clear reception and transmission.","class":1},{"text":"bad fit, way too big.","class":0},{"text":"It definitely was not as good as my S11.","class":1},{"text":"awesome device.","class":1},{"text":"Waste of money.","class":0},{"text":"I had ordered a motorola data cable, got a very well finished and working product.","class":1},{"text":"Love This Phone.","class":1},{"text":"I was looking for this headset for a long time and now that I've got it I couldn't be happier.","class":1},{"text":"I'll be drivng along, and my headset starts ringing for no reason.","class":0},{"text":"Display is excellent and camera is as good as any from that year.","class":1},{"text":"Battery life is also great!","class":1},{"text":"The worst phone I've ever had.... Only had it for a few months.","class":0},{"text":"Not a good item.. It worked for a while then started having problems in my auto reverse tape player.","class":0},{"text":"This is so embarassing and also my ears hurt if I try to push the ear plug into my ear.","class":0},{"text":"Protects the phone on all sides.","class":1},{"text":"This is a VERY average phone with bad battery life that operates on a weak network.","class":0},{"text":"Clear Skype Calls, Long Battery Life, Long Range.","class":1},{"text":"Soyo technology sucks.","class":0},{"text":"Great Hands Free Device.","class":1},{"text":"you can even take self portraits with the outside (exterior) display, very cool.","class":1},{"text":"Same problem as others have mentioned.","class":0},{"text":"After trying many many handsfree gadgets this is the one that finally works well.","class":1},{"text":"Magical Help.","class":1},{"text":"The worst piece of crap ever along with the Verizon customer service.","class":0},{"text":"Poor sound quality.","class":0},{"text":"The best phone in market :).","class":1},{"text":"It worked very well.","class":1},{"text":"The company shipped my product very promptly and it works well.","class":1},{"text":"Exactly what I wanted.","class":1},{"text":"The picture resolution is far below what other comparably-priced phones are offering today.","class":0},{"text":"This is a great deal.","class":1},{"text":"Excellent product, I am very satisfied with the purchase.","class":1},{"text":"I highly recommend these and encourage people to give them a try.","class":1},{"text":"Better than you'd expect.","class":1},{"text":"Using all earpieces, left or right, this thing will not stay on my ear.","class":0},{"text":"Great product and price.","class":1},{"text":"Sounds good reasonably priced and effective, Its that simple !","class":1},{"text":"Still Waiting...... I'm sure this item would work well.. if I ever recieve it!","class":0},{"text":"what a disappointment","class":0},{"text":"Very prompt service.","class":1},{"text":"Excellent product for the price.","class":1},{"text":"Very pleased with this headset.","class":1},{"text":"don't waste your money and time.","class":0},{"text":"I especially love the long battery life.","class":1},{"text":"It's so stupid to have to keep buying new chargers, car chargers, cradles, headphones and car kits every time a new phone comes out.","class":0},{"text":"Works great.","class":1},{"text":"Plantronics Bluetooth Excelent Buy.","class":1},{"text":"I came over from Verizon because cingulair has nicer cell phones.... the first thing I noticed was the really bad service.","class":0},{"text":"I'll be looking for a new earpiece.","class":0},{"text":"I highly recommend this device to everyone!","class":1},{"text":"Jawbone Era is awesome too!","class":1},{"text":"We received a WHITE colored battery that goes DEAD after a couple hoursTHe original used to last a week - but still lasts longer than thereplacement","class":0},{"text":"After a year the battery went completely dead on my headset.","class":0},{"text":"I have used several phone in two years, but this one is the best.","class":1},{"text":"An Awesome New Look For Fall 2000!.","class":1},{"text":"This is the first phone I've had that has been so cheaply made.","class":0},{"text":"Att is not clear, sound is very distorted and you have to yell when you talk.","class":0},{"text":"The plastic breaks really easy on this clip.","class":0},{"text":"Price is good too.","class":1},{"text":"Don't make the same mistake I did.","class":0},{"text":"Oh and I forgot to also mention the weird color effect it has on your phone.","class":0},{"text":"I'm using it with an iriver SPINN (with case) and it fits fine.","class":1},{"text":"Also the area where my unit broke).- I'm not too fond of the magnetic strap.","class":0},{"text":"Overall, I am psyched to have a phone which has all my appointments and contacts in and gets great reception.","class":1},{"text":"every thing on phone work perfectly, she like it.","class":1},{"text":"Another note about this phone's appearance is that it really looks rather bland, especially in the all black model.","class":0},{"text":"IT'S REALLY EASY.","class":1},{"text":"My Sanyo has survived dozens of drops on blacktop without ill effect.","class":1},{"text":"Fantastic earphones.","class":1},{"text":"It finds my cell phone right away when I enter the car.","class":1},{"text":"Low Quality.","class":0},{"text":"I highly recommend this modest priced cellular phone.","class":1},{"text":"But it does get better reception and clarity than any phone I've had before.","class":1},{"text":"Warning - Stay away.","class":0},{"text":"I wish I could return the unit and get back my money.","class":0},{"text":"Awsome Device Works Great!!.","class":1},{"text":"I used to talk on it for 1 - 1 1/2 hours and the battery would be literally drained and dying.","class":0},{"text":"If you don't find it, too bad, as again the unit comes with one earpad only.I would not recommend this to anyone.","class":0},{"text":"Very Displeased.","class":0},{"text":"I might have gotten a defect, but I would not risk buying it again because of the built quality alone.","class":0},{"text":"They made this case too small and is very difficult to install.","class":0},{"text":"Restored my phone to like new performance.","class":1},{"text":"I would recommend purchasing the Jabra JX-10 series 2 which works flawlessly with my Moto Q, go figure.","class":1},{"text":"I searched the Internet, and found this one to be the best value.","class":1},{"text":"Does not fit.","class":0},{"text":"Very happy with this product.","class":1},{"text":"The screen size is big, key pad lit well enough, and the camera quality is excellent for a camera phone.","class":1},{"text":"There's really nothing bad I can say about this headset.","class":0},{"text":"i'm glad i found this product on amazon it is hard to find, it wasn't high priced.","class":1},{"text":"Portable and it works.","class":1},{"text":"My colleague & I now get great reception.A little expensive, but performance is great.","class":1},{"text":"I even fully charged it before I went to bed and turned off blue tooth and wi-fi and noticed that it only had 20 % left in the morning.","class":0},{"text":"I've also had problems with the phone reading the memory card in which I always turn it on and then off again.","class":0},{"text":"Not good when wearing a hat or sunglasses.","class":0},{"text":"Timely shipment and quality product.","class":1},{"text":"Nice solid keyboard.","class":1},{"text":"Very well made and fits my Surefire GX2 perfectly.","class":1},{"text":"Horrible phone.","class":0},{"text":"BT50 battery junk!.","class":0},{"text":"We would recommend these to others.","class":1},{"text":"Cant get the software to work with my computer.","class":0},{"text":"Disappointed!.","class":0},{"text":"poor voice clarity.","class":0},{"text":"The battery works great!","class":1},{"text":"No buyers remorse on this one!.","class":0},{"text":"Very disappointed in AccessoryOne.","class":0},{"text":"I find this inexcusable and so will probably be returning this phone and perhaps changing carriers.","class":0},{"text":"Looks great and is strong.\"","class":1},{"text":"I have had TMobile service for 2 or 3 years now, and I am pretty happy with it.","class":1},{"text":"The update procedure is difficult and cumbersome.","class":0},{"text":"Disappointment.. I hate anything that goes in my ear.","class":0},{"text":"Great software for Motorolas.","class":1},{"text":"The delivery was on time.","class":1},{"text":"Very easy to use.","class":1},{"text":"Uncomfortable In the Ear, Don't use with LG VX9900 (EnV).","class":0},{"text":"The volume switch rocketed out of the unit to a destination unknown.","class":0},{"text":"It holds a charge for a long time, is reasonably comfortable under long-wearing conditions and the quality of sound is tremendous.","class":1},{"text":"I'd like to return it.","class":0},{"text":"The keyboard is really worthwhile in usefulness and is sturdy enough I don't expect any problems.","class":1},{"text":"Verizon's bills, however, are difficult to understand even though their pricing plans are simple.","class":0},{"text":"After charging overnight, these batteries work great.","class":1},{"text":"You won't regret it!","class":1},{"text":"I love this phone!.","class":1},{"text":"A Disappointment.","class":0},{"text":"Its not user friendly.","class":0},{"text":"Unfortunately the ability to actually know you are receiving a call is a rather important feature and this phone is pitiful in that respect.","class":0},{"text":"Then I exchanged for the same phone, even that had the same problem.","class":0},{"text":"This results in the phone being either stuck at max volume or mute.","class":0},{"text":"This PDA rocks.","class":1},{"text":"It is super charged up for use as a small hybrid palmtop/camera/cellphone, and excels in those roles.","class":1},{"text":"I would definitely recommend the Jabra BT250v for those who are looking for comfort, clarity and a great price!","class":1},{"text":"I had Verizon 2 years ago and really liked their service.","class":1},{"text":"Pretty piece of junk.","class":0},{"text":"Plug was the wrong size.","class":0},{"text":"Works as described.","class":1},{"text":"Save your money.... I've had this item for 11 months now.","class":0},{"text":"Bad Purchase.","class":0},{"text":"WELL IM SATISFIED.","class":1},{"text":"The bose noise cancelling is amazing, which is very important for a NYC commuter.","class":1},{"text":"This battery is an excellent bargain!","class":1},{"text":"Defective crap.","class":0},{"text":"I would have given no star if I was able.","class":0},{"text":"I wear glasses and it fits fine with them.","class":1},{"text":"The sound quality for the device is unacceptable.Unless you are in a really quiet area, you almost hear nothing.","class":0},{"text":"I would not recommend this item to anyone.","class":0},{"text":"The holster that arrived did not match the photo in the ad.","class":0},{"text":"great...no problems at all!.","class":1},{"text":"As an earlier review noted, plug in this charger and nothing happens.","class":0},{"text":"This frog phone charm is adorable and very eye catching.","class":1},{"text":"You never know if you pushed it hard enough or the right number of times for the function you want or not.","class":0},{"text":"The sound is clear and the people I talk to on it are amazed at the quality too.","class":1},{"text":"I got the aluminum case for my new Palm VX and it worked really well--it has protected my handheld perfectly so far.","class":1},{"text":"very good product, well made.","class":1},{"text":"Mobile Phone Tools are a must have.","class":1},{"text":"I am very impressed with the job that Motorola did on the sturdiness of this phone.","class":1},{"text":"I received my orders well within the shipping timeframe, everything was in good working order and overall, I am very excited to have this source.","class":1},{"text":"The phone is sturdy and waterproof.","class":1},{"text":"I am not impressed with this and i would not recommend this item to anyone.","class":0},{"text":"My only complaint is the standard sound volume is a little low even when turned up to 5(of 5)","class":0},{"text":"Thanks again to Amazon for having the things I need for a good price!","class":1},{"text":"I ended up sliding it on the edge of my pants or back pockets instead.","class":1},{"text":"I had to go to a store and bought a new NOKIA phone which is working great.","class":1},{"text":"Works great!.","class":1},{"text":"REALLY UGLY.","class":0},{"text":"horrible, had to switch 3 times.","class":0},{"text":"The noise shield is incrediable.","class":1},{"text":"No real improvement.","class":0},{"text":"Razr Battery - Good buy.","class":1},{"text":"Keep up the good work Amazon!!","class":1},{"text":"They refuse to refund or replace.","class":0},{"text":"Unfortunately it's easy to accidentally activate them with the gentle-touch buttons if you accidentally touch the phone to your face while listening.","class":0},{"text":"So I basically threw my money out the window for nothing.","class":0},{"text":"Great case and price!","class":1},{"text":"All it took was one drop from about 6 inches above the kitchen counter and it was cracked.I am not impressed and I am not laughing.","class":0},{"text":"Bluetooth range is good - a few days ago I left my phone in the trunk, got a call, and carried the conversation without a hitch.","class":1},{"text":"Small, sleek, impressive looking, practical setup with ample storage in place.","class":1},{"text":"The eargels channel the sound directly into your ear and seem to increase the sound volume and clarity.","class":1},{"text":"none of the new ones have ever quite worked properly.","class":0},{"text":"I am glad I purchased it.","class":1},{"text":"I've missed numerous calls because of this reason.","class":0},{"text":"Perhaps my phone is defective, but people cannot hear me when I use this.","class":0},{"text":"Don't buy this product.","class":0},{"text":"sucked, most of the stuff does not work with my phone.","class":0},{"text":"No shifting, no bubbling, no peeling, not even a scratch, NOTHING!I couldn't be more happier with my new one for the Droid.","class":1},{"text":"Worst software ever used.... If I could give this zero stars I would.","class":0},{"text":"Trying to make a call on these is an exercise in frustration.","class":0},{"text":"The case is a flimsy piece of plastic and has no front or side protection whatsoever.","class":0},{"text":"I own a Jabra Earset and was very happy with it, but the sound quality, especially outgoing, on this is better.","class":1},{"text":"I love the camera, it's really pretty good quality.","class":1},{"text":"Thank you for such great service.","class":1},{"text":"Its a total package.","class":1},{"text":"The seller is very understanding and patient, I would definitely buy from them again.","class":1},{"text":"I give Wirefly 1 star.I will contact Cingular/AT&T; and inform them of this practice.","class":0},{"text":"It's AGGRAVATING!","class":0},{"text":"Great product for the price!.","class":1},{"text":"I have purchased these for both family and friends, and all enjoy their clarity and ease of use","class":1},{"text":"Virgin Wireless rocks and so does this cheap little phone!","class":1},{"text":"None of it works, just don't buy it.","class":0},{"text":"Muddy, low quality sound, and the casing around the wire's insert was poorly super glued and slid off.","class":0},{"text":"Please dont waste your money.","class":0},{"text":"All in all, I'm quite satisfied with this purchase.","class":1},{"text":"If you are looking for a good quality Motorola Headset keep looking, this isn't it.","class":0},{"text":"Yet Plantronincs continues to use the same flawed charger design.","class":0},{"text":"Disapointing Results.","class":0},{"text":"Cumbersome design.","class":0},{"text":"Great it was new packaged nice works good, no problems and it came in less time then I expected!!!!","class":1},{"text":"Great Product.","class":1},{"text":"It's A PIECE OF CRAP!","class":0},{"text":"My experience was terrible..... This was my fourth bluetooth headset, and while it was much more comfortable than my last Jabra (which I HATED!!!","class":0},{"text":"This fixes all the problems.","class":1},{"text":"Worst ever.","class":0},{"text":"I am very happy","class":1},{"text":"I've had no trouble accessing the Internet, downloading ringtones or performing any of the functions.","class":1},{"text":"I can barely ever hear on it and am constantly saying \"what?\"","class":0},{"text":"The battery life is highly unacceptable.","class":0},{"text":"That company is a joke.","class":0},{"text":"It does everything the description said it would.","class":1},{"text":"Due to this happening on every call I was forced to stop using this headset.","class":0},{"text":"It works great with a car charger, especially if you cannot plug in two adapters at the same time.","class":1},{"text":"Verizon tech support walked my through a few procedures, none of which worked and I ended up having to do a hard re-set, wiping out all my data.","class":0},{"text":"Voice Quality, Signal Strength, Dropped Calls.","class":0},{"text":"It plays louder than any other speaker of this size; the price is so low that most would think the quality is lacking, however, it's not.","class":1},{"text":"Better than expected.","class":1},{"text":"It feels poorly constructed, the menus are difficult to navigate, and the buttons are so recessed that it is difficult to push them.","class":0},{"text":"Battery is holding up well.","class":1},{"text":"Also difficult to put on.I'd recommend avoiding this product.","class":0},{"text":"I only used it two days, and it wasn't always easy to hear with.","class":0},{"text":"I got the car charger and not even after a week the charger was broken...I went to plug it in and it started smoking.","class":0},{"text":"Sprint - terrible customer service.","class":0},{"text":"Linked to my phone without effort.","class":1},{"text":"THey are so cool!","class":1},{"text":"Easy to use.","class":1},{"text":"Better Than New.","class":1},{"text":"What possesed me to get this junk, I have no idea...","class":0},{"text":"Piece of trash.","class":0},{"text":"A pretty good product.","class":1},{"text":"This is a great phone!.","class":1},{"text":"For the price on Amazon, it is an excellent product, which I would highly recommend.","class":1},{"text":"Their Research and Development division obviously knows what they're doing.","class":1},{"text":"The real killer is the volume, and of course it breaking.","class":0},{"text":"Those phones are working just fine now.","class":1},{"text":"I am more than happy with this product.","class":1},{"text":"Poor Construction.","class":0},{"text":"This is infuriating.","class":0},{"text":"Overall, I would recommend this phone over the new Walkman.","class":1},{"text":"Sprint charges for this service.","class":0},{"text":"It is cheap, and it feel and look just as cheap.","class":0},{"text":"It fits my ear well and is comfortable on.","class":1},{"text":"It doesn't work in Europe or Asia.","class":0},{"text":"clipping this to your belt will deffinitely make you feel like 50 cent's up-and-coming.","class":1},{"text":"I like design and look of Jabra behing the ear headsets and 5020 is pretty comfortible to wear 24 hours a day without pain in the ear.","class":1},{"text":"I was amazed at the quick arrival of the two original lg cell phone batteries and and at a fraction of the price.","class":1},{"text":"the worst phone from samsung...crap..... this crappy Samsung E715.. is the worst i have ever seeen.","class":0},{"text":"the charger worked for about a week and then completely stopped charging my phone.","class":0},{"text":"Poor product.","class":0},{"text":"However I needed some better instructions.","class":0},{"text":"You need two hands to operate the screen.This software interface is decade old and cannot compete with new software designs.","class":0},{"text":"Worked very well paired with a Treo 700w and as a Skype headset on my PC (using a USB Bluetooth transceiver).","class":1},{"text":"Steer clear of this product and go with the genuine Palm replacementr pens, which come in a three-pack.","class":0},{"text":"DO NOT BUY DO NOT BUYIT SUCKS","class":0},{"text":"This is a great product..... sure beats using your fingers!.","class":1},{"text":"Plus, I seriously do not believe it is worth its steep price point.","class":0},{"text":"All the other cases I've tried normally fall apart after a few months but this one seems to be in for the long haul.","class":1},{"text":"Very Dissapointing Performance.","class":0},{"text":"Don't make the same mistake that I did and please don't buy this phone.","class":0},{"text":"This phone might well be the worst I've ever had in any brand.","class":0},{"text":"Case was more or less an extra that I originally put on but later discarded because it scratched my ear.","class":0},{"text":"I recommend iGo to anyone with different brand cell phones/mp3 players in the family.","class":1},{"text":"Don't bother - go to the store.","class":0},{"text":"I posted more detailed comments under the grey or black phone, but i have the Fire Red and it's a great color!","class":1},{"text":"I did not have any problem with this item and would order it again if needed.","class":1},{"text":"You get what you pay for I guess.","class":0},{"text":"Not only did the software do a great job of this, I could also make my own ringtones form my existing CDs without an internet connection.","class":1},{"text":"im surprised this is a good quality car charger and there's not much reviews about it.","class":1},{"text":"These are fabulous!","class":1},{"text":"However, BT headsets are currently not good for real time games like first-person shooters since the audio delay messes me up.","class":0},{"text":"I used bitpim (a free program you can find on the internet)to transfer data to the phone.The price of the cable was excellent.","class":1},{"text":"Disappointing accessory from a good manufacturer.","class":0},{"text":"Performed awful -- muffled, tinny incoming sound and severe echo for those on the other end of the call.","class":0},{"text":"Very wind-resistant.","class":1},{"text":"Obviously they have a terrible customer service, so you get what you pay for.","class":0},{"text":"They do not last forever, but is not overly expensive to replace.Easy to operate and the sound is much better than others I have tried.","class":1},{"text":"I contacted the company and they told me that, although the unit was still under warranty, if I couldn't produce my receipt I was out of luck.","class":0},{"text":"Linksys should have some way to exchange a bad phone for a refurb unit or something!","class":0},{"text":"Phone is sturdy as all nokia bar phones are.","class":1},{"text":"Great phone.","class":1},{"text":"When I placed my treo into the case, not only was it NOT snug, but there was A LOT of extra room on the sides.","class":0},{"text":"I'm pleased.","class":1},{"text":"Battery is terrible.","class":0},{"text":"I found the product to be easy to set up and use.","class":1},{"text":"The earpiece on this is too large or too heavy...it keeps falling out of my ear.","class":0},{"text":"Utter crap.. Sound quality is TERRIBLE.","class":0},{"text":"The charger arrived within the promised timeframe, but it did not work.","class":0},{"text":"No ear loop needed, it's tiny and the sound is great.","class":1},{"text":"Finally, after three or four times the spring of the latch broke and I could not use it any longer on the visor.","class":0},{"text":"The handsfree part works fine, but then the car tries to download the address book, and the Treo reboots.Overall, I still rate this device high.","class":1},{"text":"Talk about USELESS customer service.","class":0},{"text":"It felt too light and \"tinny.\".","class":0},{"text":"This does not fit the Palm Tungsten E2 and it broke the first time I tried to plug it in.","class":0},{"text":"I'm happy about this purchase- good quality and low price.","class":1},{"text":"I love the look and feel of Samsung flipphones.","class":1},{"text":"Its well-designed and very sharp -- the blue is a very nice color.","class":1},{"text":"Does everything it should and more.","class":1},{"text":"I could not recommend these more.","class":0},{"text":"Nice Sound.","class":1},{"text":"Looks good in the picture, but this case was a huge disappointment!!","class":0},{"text":"Much less than the jawbone I was going to replace it with.","class":1},{"text":"Setup went very smoothly.","class":1},{"text":"its extremely slow and takes forever to do anything with it.","class":0},{"text":"A must study for anyone interested in the \"worst sins\" of industrial design.","class":0},{"text":"The first thing that happened was that the tracking was off.","class":0},{"text":"It is well made, easy to access the phone and has a handy, detachable belt clip.","class":1},{"text":"Then I had to continue pairing it periodically since it somehow kept dropping.","class":0},{"text":"Can't upload ringtones from a third party.","class":0},{"text":"Bluetooth does not work, phone locks up, screens just flash up and now it just makes calls randomly while in my pocket locked.","class":0},{"text":"Truly awful.","class":0},{"text":"It works fine on my Motorola 325 cellphone, and a lot better than the worn-out battery did.","class":1},{"text":"The volume for the ringer is REAL good (you have choices how loud).","class":1},{"text":"And none of the tones is acceptable.","class":0},{"text":"camera color balance is AWFUL.","class":0},{"text":"This product is clearly not ready for prime time, I don't care how cool it looks, if you can't tell a call is coming in it's worthless.","class":0},{"text":"I love the ringtones because they are so upbeat!","class":1},{"text":"Chinese Forgeries Abound!.","class":0},{"text":"Easy to pair with my Samsung Cell.","class":1},{"text":"The instructions didn't explain that a microphone jack could be used.","class":0},{"text":"i would advise to not purchase this item it never worked very well.","class":0},{"text":"Too bad you have to pay up to $$$ a month for the service!","class":0},{"text":"Works well.","class":1},{"text":"The nokia CA-42 USB cable did not work with my phone.","class":0},{"text":"Clear crisp sound.","class":1},{"text":"I have to use the smallest earpieces provided, but it stays on pretty well.","class":1},{"text":"The biggest complaint I have is, the battery drains superfast.","class":0},{"text":"The design might be ergonomic in theory but I could not stand having these in my ear.","class":0},{"text":"Do NOT buy if you want to use the holster.","class":0},{"text":"The phone can also take great pictures and even video clips.","class":1},{"text":"It doesn't make you look cool.","class":0},{"text":"Because both ears are occupied, background is not distracting at all.","class":1},{"text":"Comfortable fit - you need your headset to be comfortable for at least an hour at a time, if not for an entire day.","class":1},{"text":"Also, the phone doesn't seem to accept anything except CBR mp3s, preferably ripped by Windows Media Player.","class":0},{"text":"You can't beat the price on these.","class":1},{"text":"* Comes with a strong light that you can use to light up your camera shots, and even flash SOS signals (seriously!","class":1},{"text":"lightweight and works well.","class":1},{"text":"So just beware.","class":0},{"text":"I love this cable - it allows me to connect any mini-USB device to my PC.","class":1},{"text":"So anyone near you will hear part of your conversation.","class":0},{"text":"This is cool because most cases are just open there allowing the screen to get all scratched up.","class":1},{"text":"I bought this phone as a replacement for my StarTac and have regretted it since.","class":0},{"text":"Appears to actually outperform the original battery from China that came with my V325i.","class":1},{"text":"Can't store anything but phone numbers to SIM.","class":0},{"text":"It lasts less than 3o minutes, if I actually try to use the phone.My wife has the same phone with the same problem.","class":0},{"text":"Poor quality.","class":0},{"text":"jabra ear gels \"R\" the best!.","class":1},{"text":"Not worth it.","class":0},{"text":"The phone crashed completely and now I have to get it replaced.","class":0},{"text":"It quit working after I'd used it for about 18 months, so I just purchased another one because this is the best headset I've ever owned.","class":1},{"text":"Unfortunately it will not recharge my iPhone 4s, despite connecting it from multiple power sources (iMac, external battery, wall outlet, etc).","class":0},{"text":"It was a great phone.","class":1},{"text":"if you simply want a small flip phone -- look elsewhere as the extra bells & whistles are mediocre.","class":0},{"text":"Good value, works fine - power via USB, car, or wall outlet.","class":1},{"text":"My phone doesn't slide around my car now and the grip prevents my phone from slipping out of my hand.","class":1},{"text":"This is simply the BEST bluetooth headset for sound quality!","class":1},{"text":"Think it over when you plan to own this one!This sure is the last MOTO phone for me!","class":0},{"text":"In the span of an hour, I had two people exclaim \"Whoa - is that the new phone on TV?!?","class":1},{"text":"I have always used corded headsets and the freedom from the wireless is very helpful.","class":1},{"text":"This case has passed the one year mark and while it shows signs of wear, it is 100% functional.","class":1},{"text":"Other than that, the leather is nice and soft; the fit is very tight; the cut out for the face is a good shape.","class":1},{"text":"It has everything I need and I couldn't ask for more.","class":1},{"text":"After receiving and using the product for just 2 days it broke.","class":0},{"text":"This product is great... it makes working a lot easier I can go to the copier while waiting on hold for something.","class":1},{"text":"None of the three sizes they sent with the headset would stay in my ears.","class":0},{"text":"T-Mobile has the best customer service anywhere.","class":1},{"text":"Arrived quickly and much less expensive than others being sold.","class":1},{"text":"We have tried 2 units and they both failed within 2 months.. Pros","class":0},{"text":"Provides good protection and looks classy, too.","class":1},{"text":"Krussel Always good.","class":1},{"text":"The tracfonewebsite is user friendly and makes it easy toactivate, etc.","class":1},{"text":"The design is very good.4.","class":1},{"text":"I great reception all the time.","class":1},{"text":"I would highly recommend this product.","class":1},{"text":"Couldn't use the unit with sunglasses, not good in Texas!","class":0},{"text":"It dit not work most of the time with my Nokia 5320.","class":0},{"text":"Bought mainly for the charger, which broke soon after purchasing.","class":0},{"text":"If you like a loud buzzing to override all your conversations, then this phone is for you!","class":0},{"text":"Fantastic buy and will get again for whatever my next phone is","class":1},{"text":"stay away from this store, be careful.","class":0},{"text":"This BlueAnt Supertooth hands-free phone speaker is AWESOME.","class":1},{"text":"Does not fit.","class":0},{"text":".... Item arrived quickly and works great with my Metro PCS Samsung SCH-r450 slider phone and Sony Premium Sound in ear plugs.","class":1},{"text":"It is light, has plenty of battery capacity, and is very confortable to wear for somewhat extended periods of time.","class":1},{"text":"disappointing.","class":0},{"text":"Blue Ant is easy to use.","class":1},{"text":"Cheap but hey it works.. Was pleasantly suprised given the low cost of this item.","class":1},{"text":"The camera on the phone may be used as a dustpan when indoors... I'd rather be using a disposable then this.","class":0},{"text":"Then a few days later the a puff of smoke came out of the phone while in use.","class":0},{"text":"It's very convenient and simple to use - gets job done & makes the car ride so much smoother.","class":1},{"text":"The nano stated it.My son was dissapointed.","class":0},{"text":"The sound quality is excellent as well.","class":1},{"text":"Its the best headset I have used.","class":1},{"text":"Would not reccommend.","class":0},{"text":"They have been around for years and carries the highest quality of anti-glare screen protector that I have found to date.","class":1},{"text":"Just what I wanted.","class":1},{"text":"This particular model would not work with my Motorola Q smartphone.","class":0},{"text":"wont work right or atleast for me.","class":0},{"text":"in addition it feels &amp; looks as if the phone is all lightweight cheap plastic.","class":0},{"text":"But now that it is \"out of warranty\" the same problems reoccure.Bottom line... put your money somewhere else... Cingular will not support it.","class":0},{"text":"I really wanted the Plantronics 510 to be the right one, but it has too many issues for me.The good","class":0},{"text":"Great product.","class":1},{"text":"Crisp and Clear.","class":1},{"text":"AFter the first charge kept going dead after 12 minutes.","class":0},{"text":"VERY cheap plastic, creaks like an old wooden floor.","class":0},{"text":"I get absolutely horrible reception in my apartment, where with other phones I have not had this problem.","class":0},{"text":"The reception has been generally good.","class":1},{"text":"Excellent sound, battery life and inconspicuous to boot!.","class":1},{"text":"Great bluetooth!.","class":1},{"text":"I highly recommend this case.","class":1},{"text":"WORTHWHILE.","class":1},{"text":"This is a great deal.","class":1},{"text":"After my phone got to be about a year old, it's been slowly breaking despite much care on my part.","class":0},{"text":"I am sorry I made this purchase.","class":0},{"text":"I bought these hoping I could make my Bluetooth headset fit better but these things made it impossible to wear.","class":0},{"text":"Treo and T-Mobile refused to replace it again and forced me to buy another phone without any kind of upgrade discount.","class":0},{"text":"It was horrible!.","class":0},{"text":"I don't think it would hold it too securly on your belt.","class":0},{"text":"This allows the possibility of double booking for the same date and time after the first.","class":0},{"text":"They work about 2 weeks then break.","class":0},{"text":"It is simple to use and I like it.","class":1},{"text":"It's a great tool for entertainment, communication, and data management.Oh, be sure to use ActiveSync 4.2 for optimal data synchronization results!","class":1},{"text":"I can't use this case because the smell is disgusting.","class":0},{"text":"NOT WHAT I WANTED.","class":0},{"text":"I own 2 of these cases and would order another.","class":1},{"text":"Great Phone.","class":1},{"text":"I bought this battery with a coupon from Amazon and I'm very happy with my purchase.","class":1},{"text":"The internet access was fine, it the rare instance that it worked.","class":0},{"text":"Perfect for the PS3.","class":1},{"text":"Five star Plus, plus.","class":1},{"text":"A good quality bargain.. I bought this after I bought a cheapy from Big Lots that sounded awful and people on the other end couldn't hear me.","class":1},{"text":"$50 Down the drain.","class":0},{"text":"I tried talking real loud but shouting on the telephone gets old and I was still told it wasn't great.","class":0},{"text":"Good , works fine.","class":1},{"text":"For the price this was a great deal.","class":1},{"text":"Great price, too!","class":1},{"text":"If there is a wind, it is completely useless.","class":0},{"text":"Yes it's shiny on front side - and I love it!","class":1},{"text":"Does Not Work.","class":0},{"text":"At first I thought I was grtting a good deal at $7.44, until I plugged it into my phone (V3c Razr).","class":0},{"text":"The reception through this headset is excellent.","class":1},{"text":"2 thumbs up to this seller","class":1},{"text":"I have a Verizon LG phone and they work well together, good reception and range that exceeds 20 feet line of sight.","class":1},{"text":"Improper description.... I had to return it.","class":0},{"text":"#1 It Works - #2 It is Comfortable.","class":1},{"text":"Battery charge-life is quite long.","class":1},{"text":"The Jabra EarGels fit my ears very well.","class":1},{"text":"Battery has no life.","class":0},{"text":"I checked everywhere and there is no feature for it which is really disappointing.","class":0},{"text":"Product is exactly as described.","class":1},{"text":"Gets a signal when other Verizon phones won't.","class":1},{"text":"Doesn't do the job.","class":0},{"text":"I would recommend it.","class":1},{"text":"Plan on ordering from them again and again.","class":1},{"text":"That being said, for a phone, the camera is very nice; many cool effects to play with, and video is decent as well.","class":1},{"text":"I have been very satisfied with this cell phone from day one.","class":1},{"text":"They keep getting better and better (this is my third one and I've had numerous Palms too).","class":1},{"text":"Awkward to use and unreliable.","class":0},{"text":"The shipping time was also very quick!","class":1},{"text":"Not as good as I had hoped.","class":0},{"text":"Good case!.","class":1},{"text":"Doesn't Work.","class":0},{"text":"Really good product.","class":1},{"text":"Unfortunately it did not work.","class":0},{"text":"All three broke within two months of use.","class":0},{"text":"dont buy it.","class":0},{"text":"My father has the V265, and the battery is dying.","class":0},{"text":"However, the ear pads come off easily and after only one week I lost one.","class":0},{"text":"The calls drop, the phone comes on and off at will, the screen goes black and the worst of all it stops ringing intermittently.","class":0},{"text":"Horrible, horrible protector.","class":0},{"text":"I don't like this Nokia either.","class":0},{"text":"Reaching for the bottom row is uncomfortable, and the send and end keys are not where I expect them to be.3.","class":0},{"text":"I have bought this Nokia cell phone a few weeks ago and it was a nightmare.","class":0},{"text":"It would take too long to describe how bad my customer service experience has been with Amazon.","class":0},{"text":"the only VERY DISAPPOINTING thing was there was NO SPEAKERPHONE!!!!","class":0},{"text":"Terrible.. My car will not accept this cassette.","class":0},{"text":"Product is useless, since it does not have enough charging current to charge the 2 cellphones I was planning to use it with.","class":0},{"text":"It's not what it says it is.","class":0},{"text":"Stay Away From the Q!.","class":0},{"text":"Used and dirty.","class":0},{"text":"Very unreliable service from T-mobile !","class":0},{"text":"Not good enough for the price.","class":0},{"text":"I bought two of them and neither will charge.","class":0},{"text":"It looks very nice.","class":1},{"text":"This is an excellent tool, especially when paired with your phone's auto-answer.","class":1},{"text":"I have read other's reviews here but I haven't had any problem with it.","class":1},{"text":"These products cover up the important light sensor above the ear outlet.","class":0},{"text":"Comfortable in my hand.","class":1},{"text":"Just does not work.","class":0},{"text":"Poor Reliability.","class":0},{"text":"(It works!)","class":1},{"text":"If I take a picture, the battery drops a bar, and starts beeping, letting me know its dieing.","class":0},{"text":"Terrible product, and waste of money!","class":0},{"text":"Last time buying from you.","class":0},{"text":"It was a waste of my money.","class":0},{"text":"So far it has worked like a charm.","class":1},{"text":"I have only had it for a few weeks, but so far, so good.","class":1},{"text":"But, in any case, the best part is, you can download these pictures to your laptop using IR, or even send pictures from your laptop to the phone.","class":1},{"text":"Would recommend this item.","class":1},{"text":"It's been my choice headset for years.Great sound; good volume; good noise cancellation.","class":1},{"text":"Nice case, feels good in your hands.","class":1},{"text":"The item received was Counterfeit.","class":0},{"text":"Just really good.. So far, probably the best BT headset I have ever had.","class":1},{"text":"Works fine.","class":1},{"text":"I received my headset in good time and was happy with it.","class":1},{"text":"I was very pleased to see that I could replace my well travled swivel holster for my Blackberry flip.","class":1},{"text":"My sister has one also and she loves it.","class":1},{"text":"Good Quality.","class":1},{"text":"This is by far the worst purchase I've made on Amazon.","class":0},{"text":"Excellent dual-purpose headset.","class":1},{"text":"Excellent!.","class":1},{"text":"Does not work for listening to music with the cingular 8125.","class":0},{"text":"It seems completely secure, both holding on to my belt, and keeping the iPhone inside.","class":1},{"text":"The bottowm line...another worthless, cheap gimmick from Sprint.","class":0},{"text":"Having trouble with volume.","class":0},{"text":"The only good thing was that it fits comfortably on small ears.","class":1},{"text":"WARNING - DO NOT BUY!!.","class":0},{"text":"I am pairing this with my iphone, and I could not be happier with it so far.","class":1},{"text":"When it opens, the battery connection is broken and the device is turned off.","class":0},{"text":"I didn't want the clip going over the top of my ear, causing discomfort.","class":0},{"text":"Best headset ever!!!.","class":1},{"text":"Don't trust their website and don't expect any helpful support.","class":0},{"text":"It was that loud.Glad to say that the Plantronics 510 maintains a flawless connection to my cell and with no static during normal use.","class":1},{"text":"The speaker is of low quality so as making the ring tones sound very cheap.","class":0},{"text":"Fits comfortably, came with three sizes of earbud tips.","class":1},{"text":"Excellent product for the price.","class":1},{"text":"Bad Reception.","class":0},{"text":"This product is very High quality Chinese CRAP!!!!!!","class":0},{"text":"It was quite comfortable in the ear.","class":1},{"text":"Great phone.","class":1},{"text":"Don't buy this product - It fails!.","class":0},{"text":"Everything about this product is wrong.First","class":0},{"text":"The pairing of the two devices was so easy it barely took a couple minutes before I started making calls with the voice dialing feature.","class":1},{"text":"This was utterly confusing at first, which caused me to lose a couple of very, very important contacts.","class":0},{"text":"Terrible phone holder.","class":0},{"text":"The cutouts and buttons are placed perfectly.","class":1},{"text":"I love being able to use one headset for both by land-line and cell.","class":1},{"text":"Problem is that the ear loops are made of weak material and break easily.","class":0},{"text":"Not nearly as good looking as the AMAZON picture makes it look.","class":0},{"text":"But despite these few flaws, this case is of exceptional quality and well worth the additional costs of owning an official OEM product.","class":1},{"text":"How stupid is that?","class":0},{"text":"I can hear while I'm driving in the car, and usually don't even have to put it on it's loudest setting.","class":1},{"text":"Seller shipped quickly and much cheaper than the competitors.","class":1},{"text":"Good show, Samsung.","class":1},{"text":"So I bought about 10 of these and saved alot of money.","class":1},{"text":"It always cuts out and makes a beep beep beep sound then says signal failed.","class":0},{"text":"Couldn't figure it out","class":0},{"text":"My phone sounded OK ( not great - OK), but my wife's phone was almost totally unintelligible, she couldn't understand a word being said on it.","class":0},{"text":"So I had to take the battery out of the phone put it all back together and then restart it.","class":0},{"text":"While I managed to bend the leaf spring back in place, the metal now has enough stress that it will break on the next drop.","class":0},{"text":"Leopard Print is wonderfully wild!.","class":1},{"text":"Works for me.","class":1},{"text":"Saggy, floppy piece of junk.","class":0},{"text":"much better than the hard plastic cases.","class":1},{"text":"It also had a new problem.","class":0},{"text":"Happy so far!.","class":1},{"text":"cool phone.","class":1},{"text":"Works good.","class":1},{"text":"Motorola finally got the voice quality of a bluetooth headset right.","class":1},{"text":"It looses connection to the phone even when it is within a couple feet between the two.","class":0},{"text":"but it is great, i would really recommend it","class":1},{"text":"Makes it easier to keep up with my bluetooth when I'm not wearing it.","class":0},{"text":"As I said above....PRETTY USELESS!","class":0},{"text":"Never got it!!!!!","class":0},{"text":"This pair of headphones is the worst that I have ever had sound-wise.","class":0},{"text":"[...] down the drain because of a weak snap!","class":0},{"text":"Does not charge the Cingular (ATT) 8525 phone.","class":0},{"text":"You get extra minutes so that you can carry out the call and not get cut off.\"","class":1},{"text":"However, after about a year, the fliptop started to get loose and wobbly and eventually my screen went black and I couldn't receive and place calls.","class":0},{"text":"I kept catching the cable on the seat and I had to pull the phone out to turn it on an off.","class":0},{"text":"The headset fulfills my requirements so I am happy with my purchase.","class":1},{"text":"Logitech Bluetooth Headset is a 10!.","class":1},{"text":"I like the fact that it rests lightly against your ear, rather than inside.","class":1},{"text":"A lot of websites have been rating this a very good phone and so do I.","class":1},{"text":"I have tried these cables with my computer and my iPod and it works just fine.","class":1},{"text":"The mic there is a joke, and the volume is quite low.","class":0},{"text":"I'm returning them.","class":0},{"text":"I does not maintain a connection with the computer while it is on my lap.","class":0},{"text":"It is easy to turn on and off when you are in the car and the volume controls are quite accessable.","class":1},{"text":"I have had mine for about a year and this Christmas I bought some for the rest of the family.","class":1},{"text":"Otherwise, easy to install and use, clear sound.","class":1},{"text":"nice leather.","class":1},{"text":"I had to purchase a different case.","class":0},{"text":"It is a joy to use.","class":1},{"text":"Very much disappointed with this company.","class":0},{"text":"Very satisifed with that.","class":1},{"text":"It didn't charge for me.","class":0},{"text":"This is the phone to get for 2005.... I just bought my S710a and all I can say is WOW!","class":1},{"text":"Buttons are too small.","class":0},{"text":"Just reading on the specs alone makes you say WOW.","class":1},{"text":"Love it.. Great armband.","class":1},{"text":"I really like this product over the Motorola because it is allot clearer on the ear piece and the mic.","class":1},{"text":"However, the keypads are so tinny that I sometimes reach the wrong buttons.","class":0},{"text":"I exchanged the sony ericson z500a for this and I'm pretty happy with that decision.","class":1},{"text":"I was very impressed with the price of the cases.","class":1},{"text":"Also makes it easier to hold on to.","class":1},{"text":"I use this product in a motor control center where there is a lot of high voltage humming from the equipment, and it works great!","class":1},{"text":"It's pretty easy.","class":1},{"text":"I cannot make calls at certain places.","class":0},{"text":"however, my girl was complain that some time the phone doesn't wake up like normal phone does.","class":0},{"text":"Beautiful styling though.","class":1},{"text":"This company charge me a restocking fee and still not given me my refund back.","class":0},{"text":"I'm trying to return it for a refund.","class":0},{"text":"I plugged it in only to find out not a darn thing worked.","class":0},{"text":"Excellent product.","class":1},{"text":"Earbud piece breaks easily.","class":0},{"text":"Lousy product.","class":0},{"text":"This phone tries very hard to do everything but fails at it's very ability to be a phone.","class":0},{"text":"It is the best charger I have seen on the market yet.","class":1},{"text":"SWEETEST PHONE!!!","class":1},{"text":":-)Oh, the charger seems to work fine.","class":1},{"text":"It fits so securely that the ear hook does not even need to be used and the sound is better directed through your ear canal.","class":1},{"text":"Not enough volume.","class":0},{"text":"Echo Problem....Very unsatisfactory","class":0},{"text":"you could only take 2 videos at a time and the quality was very poor.","class":0},{"text":"don't waste your money.","class":0},{"text":"I am going to have to be the first to negatively review this product.","class":0},{"text":"Adapter does not provide enough charging current.","class":0},{"text":"There was so much hype over this phone that I assumed it was the best, my mistake.","class":0},{"text":"You also cannot take pictures with it in the case because the lense is covered.","class":0},{"text":"Phone falls out easily.","class":0},{"text":"It didn't work, people can not hear me when I talk.","class":0},{"text":"The text messaging feature is really tricky to use.","class":0},{"text":"I'm really disappointed all I have now is a charger that doesn't work.","class":0},{"text":"Painful on the ear.","class":0},{"text":"Lasted one day and then blew up.","class":0},{"text":"disappointed.","class":0},{"text":"Kind of flops around.","class":0},{"text":"The screen does get smudged easily because it touches your ear and face.","class":0},{"text":"What a piece of junk.. I lose more calls on this phone.","class":0},{"text":"Item Does Not Match Picture.","class":0},{"text":"The only thing that disappoint me is the infra red port (irda).","class":0},{"text":"You can not answer calls with the unit, never worked once!","class":0},{"text":"","class":null}]