[{"text":"A very, very, very slow-moving, aimless movie about a distressed, drifting young man.  ","class":0},{"text":"Not sure who was more lost - the flat characters or the audience, nearly half of whom walked out.  ","class":0},{"text":"Attempting artiness with black & white and clever camera angles, the movie disappointed - became even more ridiculous - as the acting was poor and the plot and lines almost non-existent.  ","class":0},{"text":"Very little music or anything to speak of.  ","class":0},{"text":"The best scene in the movie was when Gerardo is trying to find a song that keeps running through his head.  ","class":1},{"text":"The rest of the movie lacks art, charm, meaning... If it's about emptiness, it works I guess because it's empty.  ","class":0},{"text":"Wasted two hours.  ","class":0},{"text":"Saw the movie today and thought it was a good effort, good messages for kids.  ","class":1},{"text":"A bit predictable.  ","class":0},{"text":"Loved the casting of Jimmy Buffet as the science teacher.  ","class":1},{"text":"And those baby owls were adorable.  ","class":1},{"text":"The movie showed a lot of Florida at it's best, made it look very appealing.  ","class":1},{"text":"The Songs Were The Best And The Muppets Were So Hilarious.  ","class":1},{"text":"It Was So Cool.  ","class":1},{"text":"This is a very \"right on case\" movie that delivers everything almost right in your face.  ","class":1},{"text":"It had some average acting from the main person, and it was a low budget as you clearly can see.  ","class":0},{"text":"This review is long overdue, since I consider A Tale of Two Sisters to be the single greatest film ever made.  ","class":1},{"text":"I'll put this gem up against any movie in terms of screenplay, cinematography, acting, post-production, editing, directing, or any other aspect of film-making.  ","class":1},{"text":"It's practically perfect in all of them  a true masterpiece in a sea of faux \"masterpieces.  ","class":1},{"text":"\" The structure of this film is easily the most tightly constructed in the history of cinema.  ","class":1},{"text":"I can think of no other film where something vitally important occurs every other minute.  ","class":1},{"text":"In other words, the content level of this film is enough to easily fill a dozen other films.  ","class":1},{"text":"How can anyone in their right mind ask for anything more from a movie than this?  ","class":1},{"text":"It's quite simply the highest, most superlative form of cinema imaginable.  ","class":1},{"text":"Yes, this film does require a rather significant amount of puzzle-solving, but the pieces fit together to create a beautiful picture.  ","class":1},{"text":"This short film certainly pulls no punches.  ","class":0},{"text":"Graphics is far from the best part of the game.  ","class":0},{"text":"This is the number one best TH game in the series.  ","class":1},{"text":"It deserves strong love.  ","class":1},{"text":"It is an insane game.  ","class":1},{"text":"There are massive levels, massive unlockable characters... it's just a massive game.  ","class":1},{"text":"Waste your money on this game.  ","class":1},{"text":"This is the kind of money that is wasted properly.  ","class":1},{"text":"Actually, the graphics were good at the time.  ","class":1},{"text":"Today the graphics are crap.  ","class":0},{"text":"As they say in Canada, This is the fun game, aye.  ","class":1},{"text":"This game rocks.  ","class":1},{"text":"Buy it, play it, enjoy it, love it.  ","class":1},{"text":"It's PURE BRILLIANCE.  ","class":1},{"text":"This was a flick doomed from its conception.  ","class":0},{"text":"The very idea of it was lame - take a minor character from a mediocre PG-13 film, and make a complete non-sequel while changing its tone to a PG-rated family movie.  ","class":0},{"text":"I wasn't the least bit interested.  ","class":0},{"text":"Not only did it only confirm that the film would be unfunny and generic, but it also managed to give away the ENTIRE movie; and I'm not exaggerating - every moment, every plot point, every joke is told in the trailer.  ","class":0},{"text":"But it's just not funny.  ","class":0},{"text":"But even the talented Carrell can't save this.  ","class":0},{"text":"His co-stars don't fare much better, with people like Morgan Freeman, Jonah Hill, and Ed Helms just wasted.  ","class":0},{"text":"The story itself is just predictable and lazy.  ","class":0},{"text":"The only real effects work is the presence of all the animals, and the integration of those into the scenes is some of the worst and most obvious blue/green-screen work I've ever seen.  ","class":0},{"text":"But whatever it was that cost them so much, it didn't translate to quality, that's for sure.  ","class":0},{"text":"The film succeeds despite, or perhaps because of, an obviously meagre budget.  ","class":1},{"text":"I'm glad the film didn't go for the most obvious choice, as a lesser film certainly would have.  ","class":1},{"text":"In addition to having one of the most lovely songs ever written, French Cancan also boasts one of the cutest leading ladies ever to grace the screen.  ","class":1},{"text":"It's hard not to fall head-over-heels in love with that girl.  ","class":1},{"text":"On the negative, it's insipid enough to cause regret for another 2 hours of life wasted in front of the screen.  ","class":0},{"text":"Long, whiny and pointless.  ","class":0},{"text":"But I recommend waiting for their future efforts, let this one go.  ","class":0},{"text":"Excellent cast, story line, performances.  ","class":1},{"text":"Totally believable.  ","class":1},{"text":"Anne Heche was utterly convincing.  ","class":1},{"text":"Sam Shepard's portrayal of a gung ho Marine was sobering.  ","class":1},{"text":"I sat riveted to the TV screen.  ","class":1},{"text":"All in all I give this one a resounding 9 out of 10.  ","class":1},{"text":"I do think Tom Hanks is a good actor.  ","class":1},{"text":"I enjoyed reading this book to my children when they were little.  ","class":1},{"text":"I was very disappointed in the movie.  ","class":0},{"text":"One character is totally annoying with a voice that gives me the feeling of fingernails on a chalkboard.  ","class":0},{"text":"There is a totally unnecessary train/roller coaster scene.  ","class":0},{"text":"There was absolutely no warmth or charm to these scenes or characters.  ","class":0},{"text":"This movie totally grates on my nerves.  ","class":0},{"text":"The performances are not improved by improvisation, because the actors now have twice as much to worry about: not only whether they're delivering the line well, but whether the line itself is any good.  ","class":0},{"text":"And, quite honestly, often its not very good.  ","class":0},{"text":"Often the dialogue doesn't really follow from one line to another, or fit the surroundings.  ","class":0},{"text":"It crackles with an unpredictable, youthful energy - but honestly, i found it hard to follow and concentrate on it meanders so badly.  ","class":0},{"text":"There are some generally great things in it.  ","class":1},{"text":"I wouldn't say they're worth 2 hours of your time, though.  ","class":0},{"text":"The suspense builders were good, & just cross the line from G to PG.  ","class":1},{"text":"I especially liked the non-cliche choices with the parents; in other movies, I could predict the dialog verbatim, but the writing in this movie made better selections.  ","class":1},{"text":"If you want a movie that's not gross but gives you some chills, this is a great choice.  ","class":1},{"text":"Alexander Nevsky is a great film.  ","class":1},{"text":"He is an amazing film artist, one of the most important whoever lived.  ","class":1},{"text":"I'm glad this pretentious piece of s*** didn't do as planned by the Dodge stratus Big Shots... It's gonna help movie makers who aren't in the very restrained \"movie business\" of Québec.  ","class":0},{"text":"This if the first movie I've given a 10 to in years.  ","class":1},{"text":"If there was ever a movie that needed word-of-mouth to promote, this is it.  ","class":1},{"text":"Overall, the film is interesting and thought-provoking.  ","class":1},{"text":"Plus, it was well-paced and suited its relatively short run time.  ","class":1},{"text":"Give this one a look.  ","class":1},{"text":"I gave it a 10  ","class":1},{"text":"The Wind and the Lion is well written and superbly acted.  ","class":1},{"text":"It is a true classic.  ","class":1},{"text":"It actually turned out to be pretty decent as far as B-list horror/suspense films go.  ","class":1},{"text":"Definitely worth checking out.  ","class":1},{"text":"The problem was the script.  ","class":0},{"text":"It was horrendous.  ","class":0},{"text":"There was NOTHING believable about it at all.  ","class":0},{"text":"The only suspense I was feeling was the frustration at just how retarded the girls were.  ","class":0},{"text":"MANNA FROM HEAVEN is a terrific film that is both predictable and unpredictable at the same time.  ","class":1},{"text":"The scenes are often funny and occasionally touching as the characters evaluate their lives and where they are going.  ","class":1},{"text":"The cast of veteran actors are more than just a nostalgia trip.  ","class":1},{"text":"Ursula Burton's portrayal of the nun is both touching and funny at the same time with out making fun of nuns or the church.  ","class":1},{"text":"If you are looking for a movie with a terrific cast, some good music(including a Shirley Jones rendition of \"The Way You Look Tonight\"), and an uplifting ending, give this one a try.  ","class":1},{"text":"I don't think you will be disappointed.  ","class":1},{"text":"Frankly, after Cotton club and Unfaithful, it was kind of embarrassing to watch Lane and Gere in this film, because it is BAD.  ","class":0},{"text":"The acting was bad, the dialogs were extremely shallow and insincere.  ","class":0},{"text":"It was too predictable, even for a chick flick.  ","class":0},{"text":"Too politically correct.  ","class":0},{"text":"Very disappointing.  ","class":0},{"text":"The only thing really worth watching was the scenery and the house, because it is beautiful.  ","class":1},{"text":"I love Lane, but I've never seen her in a movie this lousy.  ","class":0},{"text":"An hour and a half I wish I could bring back.  ","class":0},{"text":"But in terms of the writing it's very fresh and bold.  ","class":1},{"text":"The acting helps the writing along very well (maybe the idiot-savant sister could have been played better), and it is a real joy to watch.  ","class":1},{"text":"The directing and the cinematography aren't quite as good.  ","class":0},{"text":"The movie was so boring, that I sometimes found myself occupied peaking in the paper instead of watching (never happened during a Columbo movie before!  ","class":0},{"text":"), and sometimes it was so embarrassing that I had to look away.  ","class":0},{"text":"The directing seems too pretentious.  ","class":0},{"text":"The scenes with the \"oh-so-mature\" neighbour-girl are a misplace.  ","class":0},{"text":"And generally the lines and plot is weaker than the average episode.  ","class":0},{"text":"Then scene where they debated whether or not to sack the trumpeter (who falsely was accused for the murder) is pure horror, really stupid.  ","class":0},{"text":"Some applause should be given to the \"prelude\" however.  ","class":1},{"text":"I really liked that.  ","class":1},{"text":"A great film by a great director.  ","class":1},{"text":"The movie had you on the edge of your seat and made you somewhat afraid to go to your car at the end of the night.  ","class":1},{"text":"The music in the film is really nice too.  ","class":1},{"text":"I'd advise anyone to go and see it.  ","class":1},{"text":"Brilliant!  ","class":1},{"text":"10/10  ","class":1},{"text":"I liked this movie way too much.  ","class":1},{"text":"My only problem is I thought the actor playing the villain was a low rent Michael Ironside.  ","class":0},{"text":"It rocked my world and is certainly a must see for anyone with no social or physical outlets.  ","class":1},{"text":"However, this didn't make up for the fact that overall, this was a tremendously boring movie.  ","class":0},{"text":"There was NO chemistry between Ben Affleck and Sandra Bullock in this film, and I couldn't understand why he would consider even leaving his wife-to-be for this chick that he supposedly was knocked out by.  ","class":0},{"text":"There were several moments in the movie that just didn't need to be there and were excruciatingly slow moving.  ","class":0},{"text":"This was a poor remake of \"My Best Friends Wedding\".  ","class":0},{"text":"All in all, a great disappointment.  ","class":0},{"text":"I cannot believe that the actors agreed to do this \"film\".  ","class":0},{"text":"I could not stand to even watch it for very long for fear of losing I.Q.  ","class":0},{"text":"I guess that nobody at the network that aired this dribble watched it before putting it on.  ","class":0},{"text":"IMDB ratings only go as low 1 for awful, it's time to get some negative numbers in there for cases such as these.  ","class":0},{"text":"I saw \"Mirrormask\" last night and it was an unsatisfactory experience.  ","class":0},{"text":"Unfortunately, inexperience of direction meant that scene after scene passed with little in the way of dramatic tension or conflict.  ","class":0},{"text":"These are the central themes of the film and they are handled ineptly, stereotypically and with no depth of imagination.  ","class":0},{"text":"All the pretty pictures in the world cannot make up for a piece of work that is flawed at the core.  ","class":0},{"text":"It is an hour and half waste of time, following a bunch of very pretty high schoolers whine and cry about life.  ","class":0},{"text":"You can't relate with them, hell you barely can understand them.  ","class":0},{"text":"This is definitely a cult classic well worth viewing and sharing with others.  ","class":1},{"text":"This movie is a pure disaster, the story is stupid and the editing is the worst I have seen, it confuses you incredibly.  ","class":0},{"text":"The fish is badly made and some of its underwater shots are repeated a thousand times in the film.  ","class":0},{"text":"A truly, truly bad film.  ","class":0},{"text":"The acting is terrible, and the writing is worse.  ","class":0},{"text":"The only possible way this movie could be redeemed would be as MST3K fodder.  ","class":0},{"text":"I paid too much.  ","class":0},{"text":"Also, it's a real treat to see Anthony Quinn playing Crazy Horse.  ","class":1},{"text":"It was so BORING!  ","class":0},{"text":"No plot whatsoever!  ","class":0},{"text":"Again, no plot at all.  ","class":0},{"text":"Horrible!  ","class":0},{"text":"Worst hour and a half of my life!Oh my gosh!  ","class":0},{"text":"I had to walk out of the theatre for a few minutes just to get some relief!  ","class":0},{"text":"I hate movies like that.  ","class":0},{"text":"Yeah, the movie pretty much sucked.  ","class":0},{"text":"THERE IS NO PLOT OR STORYLINE!!  ","class":0},{"text":"If you do go see this movie, bring a pillow or a girlfriend/boyfriend to keep you occupied through out.  ","class":0},{"text":"Awful.  ","class":0},{"text":"I don't think I've ever gone to a movie and disliked it as much.  ","class":0},{"text":"It was a good thing that the tickets only cost five dollars because I would be mad if I'd have paid $7.50 to see this crap.  ","class":0},{"text":"NOBODY identifies with these characters because they're all cardboard cutouts and stereotypes (or predictably reverse-stereotypes).  ","class":0},{"text":"This is a bad film, with bad writing, and good actors....an ugly cartoon crafted by Paul Haggis for people who can't handle anything but the bold strokes in storytelling....a picture painted with crayons.  ","class":0},{"text":"Crash is a depressing little nothing, that provokes emotion, but teaches you nothing if you already know racism and prejudice are bad things.  ","class":0},{"text":"Still, I do like this movie for it's empowerment of women; there's not enough movies out there like this one.  ","class":1},{"text":"Your brain will attempt to shut-down as part of a primal impulse of self-preservation.  ","class":0},{"text":"I was left shattered from the experience of watching this 'film' and I took a good two hours to fully recover.  ","class":0},{"text":"This movie now joins Revenge of the Boogeyman and Zombiez as part of the hellish trinity of horror films.  ","class":0},{"text":"I certainly do not mean this distinction in a good way.  ","class":0},{"text":"I mean this in a terrible way.  ","class":0},{"text":"This film has no redeeming features.  ","class":0},{"text":"Everything is appalling.  ","class":0},{"text":"Artless camera-work endlessly presents us with the ugliest setting imaginable, i.e.  ","class":0},{"text":"The story is beyond stupid.  ","class":0},{"text":"The script iswas there a script?  ","class":0},{"text":"The kids are annoying.  ","class":0},{"text":"The lead man is charisma-free.  ","class":0},{"text":"Utterly without merit on any level, this is akin to torture.  ","class":0},{"text":"I'll even say it again  this is torture.  ","class":0},{"text":"Maybe there would be a reasonable explanation for this atrocity.  ","class":0},{"text":"Not a pleasant voyage of self-discovery.  ","class":0},{"text":"Highly unrecommended.  ","class":0},{"text":"If this premise sound stupid, that's because it is.  ","class":0},{"text":"Yes, it's that bad.  ","class":0},{"text":"Nothing at all to recommend.  ","class":0},{"text":"An excellent performance from Ms.  ","class":1},{"text":"Garbo, who showed right off the bat that her talents could carry over from the silent era (I wanted to see some of her silent work, but Netflix doesn't seem to be stocking them.  ","class":1},{"text":"It's also great to see that renowned silent screenwriter Frances Marion hasn't missed a step going from silent to sound.  ","class":1},{"text":"This movie suffered because of the writing, it needed more suspense.  ","class":0},{"text":"There were too many close ups.  ","class":0},{"text":"But other than that the movie seemed to drag and the heroes didn't really work for their freedom.  ","class":0},{"text":"But this movie is definitely a below average rent.  ","class":0},{"text":"\"You'll love it!  ","class":1},{"text":"This movie is BAD.  ","class":0},{"text":"So bad.  ","class":0},{"text":"The film is way too long.  ","class":0},{"text":"This is definitely one of the bad ones.  ","class":0},{"text":"The movie I received was a great quality film for it's age.  ","class":1},{"text":"John Wayne did an incredible job for being so young in the movie industry.  ","class":1},{"text":"His on screen presence shined thought even though there were other senior actors on the screen with him.  ","class":1},{"text":"I think that it is a must see older John Wayne film.  ","class":1},{"text":"I really don't see how anyone could enjoy this movie.  ","class":0},{"text":"I don't think I've ever seen a movie half as boring as this self-indulgent piece of junk.  ","class":0},{"text":"It probably would have been better if the director hadn't spent most of the movie showcasing his own art work, which really isn't that noteworthy.  ","class":0},{"text":"Another thing I didn't really like is when a character got punched in the face, a gallon of blood would spew forth soon after.  ","class":0},{"text":"Jamie Foxx absolutely IS Ray Charles.  ","class":1},{"text":"His performance is simply genius.  ","class":1},{"text":"He owns the film, just as Spacek owned \"Coal Miner's Daughter\" and Quaid owned \"Great Balls of Fire.  ","class":1},{"text":"\" In fact, it's hard to remember that the part of Ray Charles is being acted, and not played by the man himself.  ","class":1},{"text":"Ray Charles is legendary.  ","class":1},{"text":"Ray Charles' life provided excellent biographical material for the film, which goes well beyond being just another movie about a musician.  ","class":1},{"text":"Hitchcock is a great director.  ","class":1},{"text":"Ironically I mostly find his films a total waste of time to watch.  ","class":0},{"text":"Secondly, Hitchcock pretty much perfected the thriller and chase movie.  ","class":1},{"text":"It's this pandering to the audience that sabotages most of his films.  ","class":0},{"text":"Hence the whole story lacks a certain energy.  ","class":0},{"text":"The plot simply rumbles on like a machine, desperately depending on the addition of new scenes.  ","class":0},{"text":"There are the usual Hitchcock logic flaws.  ","class":0},{"text":"Mishima is extremely uninteresting.  ","class":0},{"text":"This is a chilly, unremarkable movie about an author living/working in a chilly abstruse culture.  ","class":0},{"text":"The flat reenactments don't hold your attention because they are emotionally adrift and stagy.  ","class":0},{"text":"And the rest of it just sits there being awful... with soldiers singing songs about the masculinity they pledge themselves to, hairsplitting about purity, the admiration of swords, etc.  ","class":0},{"text":"He can bore you to pieces, and kill the momentum of a movie, quicker than anyone else.  ","class":0},{"text":"Schrader has made a resume full of lousy, amateurish films.  ","class":0},{"text":"When I first watched this movie, in the 80s, I loved it.  ","class":1},{"text":"I was totally fascinated by the music, the dancing... everything.  ","class":1},{"text":"However, I recently watched the whole thing again on DVD, and I was completely struck by how extremely stupid the storyline was - how it contained holes, inconsistencies and - frankly - a whole lot of crap - and how horrid the dancing was.  ","class":0},{"text":"I mean, in a realistic world, she would NEVER have gotten into that ballet repertory... The whole thing was quite pathetic.  ","class":0},{"text":"The character developments also lacked in depth.  ","class":0},{"text":"Woa, talk about awful.  ","class":0},{"text":"Do not waste your time.  ","class":0},{"text":"It was just too horrible.  ","class":0},{"text":"The worst, sappiest dialogue... I could go on and on.  ","class":0},{"text":"But what really made it unwatchable was the direction.  ","class":0},{"text":"The poor actors.  ","class":0},{"text":"You can't even tell if they have any talent because they not only have pathetic lines to speak but the director gave them no action.  ","class":0},{"text":"If you check the director's filmography on this site you will see why this film didn't have a chance.  ","class":0},{"text":"This would not even be good as a made for TV flick.  ","class":0},{"text":"If good intentions made a film great, then this film might be one of the greatest films ever made.  ","class":1},{"text":"The film has great actors, a master director, a significant theme--at least a would-be significant theme, undertone of fifties existential world-weariness, aerial scenes that ought to have thrilled both senses and imagination, and characters about which one might deeply care.  ","class":1},{"text":"Regrettably, the film fails.  ","class":0},{"text":"The movie lacks visual interest, drama, expression of feeling, and celebration of the very patriotism that underlines the narrative.  ","class":0},{"text":"No actress has been worse used that June Allison in this movie.  ","class":0},{"text":"Yet, I enjoy watching it.  ","class":1},{"text":"Unfortunately, this is a bad movie that is just plain bad.  ","class":0},{"text":"Bad script, bad direction and horrible acting make this one plain bad!  ","class":0},{"text":"The dialogue sucked.  ","class":0},{"text":"The cinematography-if it can be called that-sucked.  ","class":0},{"text":"The soundtrack sucked.  ","class":0},{"text":"The acting sucked.  ","class":0},{"text":"The concert sequences just sucked.  ","class":0},{"text":"That was nice.  ","class":1},{"text":"That was funny.  ","class":1},{"text":"It was so funny.  ","class":1},{"text":"Overall, this movie was cheap trash.  ","class":0},{"text":"But this movie is not funny, considering the ridiculousness of it.  ","class":0},{"text":"I came out of it feeling angry.  ","class":0},{"text":"***SPOILERS*** Whatever else can (or can't) be said about it, SURFACE is superbly crafted.  ","class":1},{"text":"The cinematography is simply stunning (to say the least) and the fx are nothing if not state-of-the-art.  ","class":1},{"text":"Conceptually, the show offers a little bit of everything- and for just about everybody (parents, kids, fantasy and/or fx fans).  ","class":1},{"text":"And there wasn't a single sour note struck acting-wise, either; some surprisingly solid casting, here.  ","class":1},{"text":"All things considered, a job very well done.  ","class":1},{"text":"Thanks good a movie like this was done and released.  ","class":1},{"text":"One of the best mexican movies ever!, and one of the less understood, even by mexican themselves, no matter how identified the should have felt with it.  ","class":1},{"text":"It ranks highly as a great noir-crime-drama, incredible performances by Belmondo and Lino Ventura.  ","class":1},{"text":"The attention given to every character, and complex psychological portrayals, detailing loyalty, treachery, love, and hope, are tremendous.  ","class":1},{"text":"It is an excellent drama, an excellent thriller, and an excellent film.  ","class":1},{"text":"Up there with the best of Melville.  ","class":1},{"text":"Everything about this film is simply incredible.  ","class":1},{"text":"You truly take this journey through the eyes and soul of a child.  ","class":1},{"text":"BLACK WATER is a thriller that manages to completely transcend it's limitations (it's an indie flick) by continually subverting expectations to emerge as an intense experience.  ","class":1},{"text":"The performances are real and gripping, the crocdodile is extremely well done, indeed if the Black Water website is to be believed that's because they used real crocs and the swamp location is fabulous.  ","class":1},{"text":"I thoroughly enjoyed it when Christopher Eccleston took control of the TARDIS and the continuation of the series.  ","class":1},{"text":"I'm not sure what he was trying to do with this film.  ","class":0},{"text":"If it was to turn my good day feeling into a night of disturbing memories than I guess he succeeded.  ","class":0},{"text":"There is a lot of beautiful places.  ","class":1},{"text":"It was forced, like everything in this movie.  ","class":0},{"text":"Again, lame.  ","class":0},{"text":"Here's where the movie really pi**ed me off.  ","class":0},{"text":"And don't even get me started on the jerky camerawork.  ","class":0},{"text":"When I saw it in the theater I thought I was going to be sick.  ","class":0},{"text":"Summary: The witticisms weren't witty.  ","class":0},{"text":"The plot - well, I said I'd let that one go.  ","class":0},{"text":"The acting was bad.  ","class":0},{"text":"Really bad.  ","class":0},{"text":"Even Billy Bob couldn't rise above the script, which was worse.  ","class":0},{"text":"Camerawork - again, bad.  ","class":0},{"text":"Rating: 1 out of 10.  ","class":0},{"text":"An AMAZING finale to possibly the BEST trilogy of all time!  ","class":1},{"text":"Kieslowski never ceases to amaze me.  ","class":1},{"text":"He is one of my favourite directors, and one of the most talented directors in the history of cinema.  ","class":1},{"text":"His use of the colours of the French flag in the three films was nothing short of incredible, every shot, every scene was like a work of art.  ","class":1},{"text":"Three of the most visually appealing movies i've ever seen.  ","class":1},{"text":"And his subtle connections between the three films are awesome.  ","class":1},{"text":"I have to mention this and it is a huge SPOILER, i loved the ending, how all the characters of the three films were the remaining survivors of the ferry disaster, with Valentine and the young judge together, and the old man watching it on her TV, solidifying his happiness over the suffering which he dealt with for those many years.  ","class":1},{"text":"I couldn't think of a better way to end the film, but a smile on my face, great way to wrap up an amazing film and trilogy!  ","class":1},{"text":"I recommend this for EVERYONE who loves film, movies, anything...A Work of Art!  ","class":1},{"text":"10 out of 10 for both the movie and trilogy.  ","class":1},{"text":"I literally vomited while watching this film.  ","class":0},{"text":"I think i was one of the people who found this another one of roth's pearls.  ","class":1},{"text":"his performance, as awarded, was stunning.  ","class":1},{"text":"the story which was told so eloquently by Francis ford Coppola 25 years earlier, really unfolds gradually and leaves room for the characters to develop.  ","class":1},{"text":"In a most wonderful location lies a story of contrast.  ","class":1},{"text":"All in all a beautiful directed film from Nicola's roeg wih a sublime cast.  ","class":1},{"text":"I'm translating movies for a living and this is the first movie in my 5-year working experience that I found offensive to my intelligence.  ","class":0},{"text":"But when someone strives for greatness and poetry, but delivers a muddled (and often ridiculous) story, a bunch of disparate scenes, pretentious dialogue... Then you get the worst kind of a movie that some other reviewer very accurately defined as \"pretentious crap\".  ","class":0},{"text":"To those who find this movie intelligent or even masterful, I can only say - it's your intelligence and your imagination you obviously used to try and make some sense of this pitiful attempt (it's in our human nature to try and make sense of things) .  ","class":0},{"text":"One more thing: I can tolerate political incorrectness very well, I'm all for artistic freedom and suspension of disbelief, but the Slavic female character was just too much.  ","class":0},{"text":"This is such a fun and funny movie.  ","class":1},{"text":"Highly entertaining at all angles.  ","class":1},{"text":"It features an outlandish array of memorable, psychotic but lovable nuts.  ","class":1},{"text":"So for our enjoyment we get to see them run around, play games, and be dangerous.  ","class":1},{"text":"It even has its sweet moments.  ","class":1},{"text":"The telephone repair man was really funny and his reactions to the nuts and bitchy boss were truly genuine.  ","class":1},{"text":"All the characters in this film are tremendously well played.  ","class":1},{"text":"And I really did find them funny.  ","class":1},{"text":"This is actually a very smart movie.  ","class":1},{"text":"There is a brilliant twist ending.  ","class":1},{"text":"\" I love it.  ","class":1},{"text":"The ending is so, SO perfect... you'll shed a tear.  ","class":1},{"text":"I am so thrilled after seeing a movie like this.  ","class":1},{"text":"I will never forget it now.  ","class":1},{"text":"It is not just a cult... it is a cult CLASSIC.  ","class":1},{"text":"Which has more depth and character than the man underneath it.  ","class":0},{"text":"The Malta settings are as dry and as barren as the dialogue.  ","class":0},{"text":"This movie is terrible.  ","class":0},{"text":"The hockey scenes are terrible, defensemen playing like they're 5 years old, goalies diving at shots that are 10 feet wide of the net, etc.  ","class":0},{"text":"For those that haven't seen it, don't waste your time!  ","class":0},{"text":"To call this movie a drama is ridiculous!  ","class":0},{"text":"Started watching this but didn't believe in any of the characters.  ","class":0},{"text":"In particular the relationship between the bakery assistant and the waitress just didn't work for me at all.  ","class":0},{"text":"It was a very superficial movie and it gave me the feeling that I was watching play rather than a film.  ","class":0},{"text":"The characters were very 'stagey' and the storyline was a lot like a stage farce.  ","class":0},{"text":"By the time the pyromaniac waylaid the assistant I was bored and didn't care what happened next and so I switched off.  ","class":0},{"text":"Glad I didn't pay to see it.  ","class":0},{"text":"Didn't laugh or even smile once.  ","class":0},{"text":"But it wasn't anything at all just one big yawn...  ","class":0},{"text":"It is a really good show to watch.  ","class":1},{"text":"It is very educational for children 1 to 8 years old.  ","class":1},{"text":"Barney is definitely super DE duper.  ","class":1},{"text":"is pretty funny.  ","class":1},{"text":"Babie Bop is very cute.  ","class":1},{"text":"The kids are very cool too.  ","class":1},{"text":"\" But \"Storm Trooper\" is not even bad enough to make it to the list of wonderfully terrible movies.  ","class":0},{"text":"It's just lame.  ","class":0},{"text":"The guy who said he's had better dialogue with his potted plants has it right.  ","class":0},{"text":"Everything about this movie is stupid.  ","class":0},{"text":"Even if you love bad movies, do not watch this movie.  ","class":0},{"text":"It is shameful.  ","class":0},{"text":"I would give this television series a 10 plus if i could.  ","class":1},{"text":"The writers were \"smack on\" and I think the best actors and actresses were a bonus to the show.These characters were so real.  ","class":1},{"text":"I must say I have taped most of the episodes and i find myself watching them over and over again.  ","class":1},{"text":"Now you know why I gave it a 10+!  ","class":1},{"text":"I don't know exactly what it is about this movie, but we latched on to this endearing movie and it has become a special part of our family's memories.  ","class":1},{"text":"I totally and absolutely recommend this movie to anyone who likes good wholesome family movies because that is exactly what this is.  ","class":1},{"text":"The things that the four kids get themselves into is absolutely hilarious to watch.  ","class":1},{"text":"This is one of the best movies out there that shows such strong sibling bond for each other.  ","class":1},{"text":"Much more interesting, more action, more suspense, and less of the unneeded controversy.  ","class":1},{"text":"Everything from acting to cinematography was solid.  ","class":1},{"text":"Definitely worth checking out.  ","class":1},{"text":"Damian is so talented and versatile in so many ways of writing and portraying different Characters on screen.  ","class":1},{"text":"This movie has a cutting edge to it.  ","class":1},{"text":"I am so pleased to know such a modern day genius is out there , letting is passion for Art drive him and taking us as an audience with him.  ","class":1},{"text":"The new characters weren't all that memorable, and I found myself forgetting who was who.  ","class":0},{"text":"I felt as though her going to Ireland did absolutely nothing whatsoever.  ","class":0},{"text":"It didn't make me scared, horrified, or make me sympathetic towards the characters; it was simply annoying.  ","class":0},{"text":"The jerky camera movements were also annoying.  ","class":0},{"text":"The plot was the same as pretty much every other cheap horror.  ","class":0},{"text":"There was a few pathetic attempts to give the characters some depth, but it didn't really work into the rest of the plot.  ","class":0},{"text":"I guess it was supposed to be clever twist, then shed some light on the situation, but it was just stupid.  ","class":0},{"text":"If you see it, you should probably just leave it on the shelf.  ","class":0},{"text":"Elias Koteas,Jack Palance play good roles Angelina is hot and gets naked.Billy Drago appears in this and is cool as usual + a cameo by Sven ole Thorsen helps make this a very enjoyable movie with good acting and a decent budget.  ","class":1},{"text":"This was such an awesome movie that i bought it off of Ebay.  ","class":1},{"text":"I really loved the story line and the poler bear was kinda cute.But if anyone has a question about Fort Steele, just ask away:)  ","class":1},{"text":"This totally UNfunny movie is so over the top and pathetic and unrealistic that throughout the whole 90 minutes of utter torture I probably looked at my watch about 70000 times!  ","class":0},{"text":"Lucy Bell is so much higher than this crap and for her to sink this low is quite depressing.  ","class":0},{"text":"All this movie does is make you sick watching all these slackers make excuses for their stupid actions for 90 minutes.  ","class":0},{"text":"God, and I can never get that 90 minutes back!  ","class":0},{"text":"I think the most wonderful parts (literally, full of \"wonder\") are the excerpts from his works.  ","class":1},{"text":"The sets (especially designed to work with the camera) are amazing....stylized, beautiful and effective.  ","class":1},{"text":"They could be used as exemplars for any set designer.  ","class":1},{"text":"The stories were powerful explorations of the nature of man and of art.  ","class":1},{"text":"After watching this film, I wanted to learn more about the works of this artist.  ","class":1},{"text":"I highly recommend this movie for anyone interested in art, poetry, theater, politics, or Japanese history.  ","class":1},{"text":"Here, in The Wind and the Lion, we see a wonderful rendering of America's own Imperial age.  ","class":1},{"text":") What makes this story different are the terrific production values - faultless photography, composition and editing - the terrific casting - the underappreciated Brian Keith playing a bully Teddy - and vivid history.  ","class":1},{"text":"Though The Wind and the Lion is told largely through the eyes of the son, every member of the family can identify with one of the characters, whether it be Sean Connery's noble brigand, Candace Bergen's feisty heroine, John Huston's wily John Hay or Steve Kanaly's spiffy, radiant, ruthless can-do lieutenant, Roosevelt's \"Big Stick\".  ","class":1},{"text":"This is high adventure at its best.  ","class":1},{"text":"I think it was Robert Ryans best film, because he portrayed someone like my father, and he was a schizophrenic in real life,(my father) although he never murdered anyone but was affected more so during the second world war which made him worse.  ","class":1},{"text":"Having to humour him just to get by and get through the day was so apt.  ","class":1},{"text":"(My mother and brother had to do this)When I saw Robert Ryan portraying this type of man, it was a very good imitation of this type of individual, and I was impressed.  ","class":1},{"text":"Almost all of the songs in Cover Girl are old-fashioned and not very tuneful.  ","class":0},{"text":"The most annoying thing about 'Cover Girl' is the way in which Rita Hayworth is put up on a pedestal.  ","class":0},{"text":"Unfortunately, 'Cover Girl' is an example of how Hollywood used to exploit women for financial gain.  ","class":0},{"text":"Non-linear narration thus many flashbacks and every part are articulated quite well.  ","class":1},{"text":"The good cinematography also makes her and Monica Bellucci look very beautiful.  ","class":1},{"text":"A good commentary of today's love and undoubtedly a film worth seeing.  ","class":1},{"text":"For people who are first timers in film making, I think they did an excellent job!!  ","class":1},{"text":"It was very popular when I was in the cinema, a good house and very good reactions and plenty of laughs.  ","class":1},{"text":"It's a feel-good film and that's how I felt when I came out of the cinema!  ","class":1},{"text":"It has northern humour and positive about the community it represents.  ","class":1},{"text":"I rather enjoyed it.  ","class":1},{"text":"I liked it.  ","class":1},{"text":"I couldn't take them seriously.  ","class":0},{"text":"It really created a unique feeling though.  ","class":1},{"text":"Vivian Schilling did an excellent job with the script.  ","class":1},{"text":"A world better than 95% of the garbage in the theatres today.  ","class":1},{"text":"Her role was played well.  ","class":1},{"text":"Not too screamy not to masculine but just right.  ","class":1},{"text":"The camera really likes her in this movie.  ","class":1},{"text":"I would have casted her in that role after ready the script.  ","class":1},{"text":"As a European, the movie is a nice throwback to my time as a student in the 1980's and the experiences I had living abroad and interacting with other nationalities, although the circumstances were slightly different.  ","class":1},{"text":"I am a fan of his ... This movie sucked really bad.  ","class":0},{"text":"Even worse than Ticker!  ","class":0},{"text":"& That movie was bad.  ","class":0},{"text":"Only like 3 or 4 buildings used, a couple of locations MAYBE, & poor hummh!  ","class":0},{"text":"It just blew.  ","class":0},{"text":"This movie is excellent!Angel is beautiful and Scamp is adorable!His little yelps when hes scared,and the funniest parts are when:Scamp is caught under the curtain and when Angel and Scamp are singing 'Ive Never Had This Feeling Before'.I totally recommend this movie,its coming out on special edition on June 20.The cover has scamp on a garbage can and Angel underneath the lid.  ","class":1},{"text":"I just cant explain this movie more than romantic,charming,hilarious,and adorable.The junkyard scenes are funny,all the junkyard dogs have something special.Too funny i laughed,kids will LOVE it.Buy it when it comes out,it has new features!  ","class":1},{"text":"Now we were chosen to be tortured with this disgusting piece of blatant American propaganda.  ","class":0},{"text":"This show is made for Americans - it is too stupid and full with hatred and clichés to be admitted elsewhere.  ","class":0},{"text":"Almost everyone involved must be return to school, acting is utterly predictable and bad, script is pile of garbage all round.  ","class":0},{"text":"I wish I could enter negative values, admins?  ","class":0},{"text":"The sets are so bad, they wouldn't look out of place on a Thunderbirds episode.  ","class":0},{"text":"The use of slow-motion needlessly repeats itself throughout the movie but is well backed up by bad acting (and bad is a kind word here), no continuity, scenes that are thrown in for no reason whatsoever, vehicles that looked like they were made from a Corn Flakes box and a directorial style that bordered on stupidity.  ","class":0},{"text":"Oh yeah, and the storyline was pathetic too.  ","class":0},{"text":"I hate writing bad reviews about films - especially those in which I really like the star - but this film is so bad I don't believe for one second that anyone could have been proud of it.  ","class":0},{"text":"I am not a filmmaker nor am I a director but I would hide my head in the sand if I'd spent whatever amount of money and time on this movie.  ","class":0},{"text":"In short - this was a monumental waste of time and energy and I would not recommend anyone to EVER see this film.  ","class":0},{"text":"It came free with a DVD player I bought but I still turned the thing off halfway through because I was embarrassed for Howell.  ","class":0},{"text":"1/10 - and only because there is no setting for 0/10.  ","class":0},{"text":"An interesting premise, and Billy Drago is always good as a dangerous nut-bag (side note: I'd love to see Drago, Stephen McHattie and Lance Hendrikson in a flick together; talk about raging cheekbones!).  ","class":1},{"text":"The soundtrack wasn't terrible, either.  ","class":1},{"text":"But the acting--even that of such professionals as Drago and Debbie Rochon--was terrible, the directing worse (perhaps contributory to the former), the dialog chimp-like, and the camera work, barely tolerable.  ","class":0},{"text":"Still, it was the SETS that got a big \"10\" on my \"oy-vey\" scale.  ","class":1},{"text":"Yes, I am simplifying things here for the sake of brevity, for this really is at the core of the problems with this film - it has too much going on without any real, fulfilling explanation.  ","class":0},{"text":"Both do good jobs and are quite amusing.  ","class":1},{"text":"But the convoluted plot just didn't convince me, and much of the film was watched with a weird, questioning glance.  ","class":0},{"text":"I let my girlfriend talk me into seeing this - bad idea, we both hated it.  ","class":0},{"text":"The last 15 minutes of movie are also not bad as well.  ","class":1},{"text":"Bela Lugosi was totally extraneous, intoning odd lines.  ","class":0},{"text":"The acting was decidely wooden, though no worse than a period Universal B movie.  ","class":0},{"text":"I like Armand Assante & my cable company's summary sounded interesting, so I watched it, twice already, and probably will again.  ","class":1},{"text":"I believe the screenwriter did a good job of tying up the loose ends.  ","class":1},{"text":"My 8/10 score is mostly for the plot.  ","class":1},{"text":"I won't say any more - I don't like spoilers, so I don't want to be one, but I believe this film is worth your time.  ","class":1},{"text":"Wow, what a bad film.  ","class":0},{"text":"Not frightening in the least, and barely comprehensible.  ","class":0},{"text":"The plot doesn't hang together at all, and the acting is absolutely appalling.  ","class":0},{"text":"Not even good for camp value!  ","class":0},{"text":"I wasn't expecting Oscar material, but this?  ","class":0},{"text":"You'd have to have the IQ of particularly stupid mollusk not to see that one coming.  ","class":0},{"text":"This film (and I use that word loosely) is an insult to the movie-going public.  ","class":0},{"text":"If only someone involved with it knew how to string together narrative!  ","class":0},{"text":"This gets a 1 out of 10, simply because there's nothing lower.  ","class":0},{"text":"This is one I did not have, but I watched it recently on Fox Movie Channel, and was very disappointed.  ","class":0},{"text":"I know he was a contract player with little control over his scripts, but the acting was as bad as the script.  ","class":0},{"text":"Victor McLaglen was even bad, and Brian DonLevy was almost unrecognizable.  ","class":0},{"text":"Considering the relations off screen between Taylor and Stanwyck, it was surprising how little chemistry there was on screen between the two of them.  ","class":0},{"text":"But the premise of the film was so ridiculous: that the President of the U.S.  ","class":0},{"text":"The death row scenes were entirely unmoving.  ","class":0},{"text":"The only thing worse than Taylor's acting was Stanwyck's singing.  ","class":0},{"text":"Whatever the producer was going for, he missed entirely.  ","class":0},{"text":"I was deeply impressed with the character he played.  ","class":1},{"text":"I knew when I saw the film that more great things were to come from this gifted actor.  ","class":1},{"text":"A cheap and cheerless heist movie with poor characterisation, lots of underbite style stoic emoting (think Chow Yun Fat in A Better Tomorrow) and some cheesy clichés thrown into an abandoned factory ready for a few poorly executed flying judo rolls a la John Woo.  ","class":0},{"text":"Even the squibs look awful.  ","class":0},{"text":"At no point in the proceedings does it look remotely like America.  ","class":0},{"text":"The plot, such as it is, is so derivative and predictable that the ending is like a mercy killing.  ","class":0},{"text":"The awful dialogue and hopeless overacting by everyone who gets shot top off a real waste of space and time.  ","class":0},{"text":"I was very uneasy with how bad this movie was, but not scared at all.  ","class":0},{"text":"The dialogue is composed of things that make little sense.  ","class":0},{"text":"About 30 minutes of footage is wasted to show mediocre elderly actors awkwardly babbling overwrought pseudo-Satanic gibberish corny enough to make a teen Goth blush, almost always in Olde English, and sometimes in Latin that may or may not be made up words.  ","class":0},{"text":"The directing is sloppy at best.  ","class":0},{"text":"Hackneyed writing, certainly, but made even worse by the bad directing.  ","class":0},{"text":"Of course, the acting is blah.  ","class":0},{"text":"The acting by the whole cast could be put on a scale and balanced perfectly between overacting and underacting.  ","class":0},{"text":"And, FINALLY, after all that, we get to an ending that would've been great had it been handled by competent people and not Jerry Falwell.  ","class":0},{"text":"I loved this movie it was a great portrayal of a family who had it's share of ups and down, but in the end they knew that special love they had for each other.  ","class":1},{"text":"I have seen many movies starring Jaclyn Smith, but my god this was one of her best, though it came out 12 years ago.  ","class":1},{"text":"This movie contained an all-star cast, and what I loved the most was that it opened my eyes to see other actors who I haven't seen before.  ","class":1},{"text":"This movie was kind of long in length, but I enjoyed every minute of it.  ","class":1},{"text":"Overall I rate this movie a 10 out of a 1-10 scale.  ","class":1},{"text":"Lifetime does not air it enough, so if anyone knows what store sells it let me know because this is a must-have.  ","class":1},{"text":"I particularly remember my senses being assaulted by strident cords of music that would blare out with very little warning, and even less meaning.  ","class":0},{"text":"It is just the sort of pap that is screened in the afternoon to punish the unemployed for not having jobs.  ","class":0},{"text":"Totally different, with loads of understatement and black comedy, this is a film few get to see, but those who do will remember it.  ","class":1},{"text":"This movie creates its own universe, and is fascinating in every way.  ","class":1},{"text":"But this movie really got to me.  ","class":1},{"text":"See it.  ","class":1},{"text":"I really hope the team behind this movie makes more movies, and that they will continue to do so in their own, some kinda weird style.  ","class":1},{"text":"And I forgot: The Casting here i superb, with Trond Fausa Aurvåg being perfect in the role as the Bothersome Man, who doesn't understand where he is, what he is doing and why.  ","class":1},{"text":"This movie is a good and humorous comment on life in 2006.  ","class":1},{"text":"I found this move beautiful, enjoyable, and uplifting.  ","class":1},{"text":"Initially the local sites in the film, which was filmed here in Buffalo, intrigued me.  ","class":1},{"text":"Later I found myself lost in the power of the film.  ","class":1},{"text":"The entire audience applauded at the conclusion of the film.  ","class":1},{"text":"I left the theater with a lilt in my step, joy in my heart and hope for the human race.  ","class":1},{"text":"Duris has a wholesome appearance and gives a fine performance.  ","class":1},{"text":"The rest of the cast also play well.  ","class":1},{"text":"Cinematography noteworthy including fine views of Barcelona and its famed Gaudi towers.  ","class":1},{"text":"About ten minutes into this film I started having second thoughts.  ","class":0},{"text":"About half way through this film I started to dislike it.  ","class":0},{"text":"By the time the film ended, I not only disliked it, I despised it.  ","class":0},{"text":"What this film lacks is a convincing script.  ","class":0},{"text":"The script looks as if only a rough draft was written and shooting began before a finished script was completed.  ","class":0},{"text":"Things happen, characters personalities change, plot twists occur for no real reason other than that script calls for it.  ","class":0},{"text":"The cast is good.  ","class":1},{"text":"For that, it's worth checking out.  ","class":1},{"text":"This is probably the most irritating show I have ever seen in my entire life.  ","class":0},{"text":"It is indescribably the most annoying and idiotic show I have ever seen.  ","class":0},{"text":"Everything about it is just bad.  ","class":0},{"text":"I could not understand, what kind of idiot would produce this mess in the first place not to mention several season.  ","class":0},{"text":"The script is bad, very bad  it contains both cheesiness and unethical joke that you normally see in rated R or NC-17 movie.  ","class":0},{"text":"The casting is also horrible, cause all you see is a really really BAD Actors, period.  ","class":0},{"text":"Final Word: This Show is a real torture!!  ","class":0},{"text":"It is zillion times away from reality.  ","class":0},{"text":"Watching washing machine twirling around wouldn't hurt your eyes as much as this show.  ","class":0},{"text":"Rating: 0/10 (Grade: Z) Note: The Show Is So Bad That Even Mother Of The Cast Pull Her Daughter Out Of The Show.  ","class":0},{"text":"20th Century Fox's ROAD HOUSE 1948) is not only quite a silly noir but is an implausible unmitigated bore of a movie.  ","class":0},{"text":"Full of unconvincing cardboard characters it is blandly written by Edward Chodorov, who also produced, and is surprisingly directed by Jean Negulesco from whom one would expect a great deal more.  ","class":0},{"text":"From here on the Widmark character turns unintentionally comical!  ","class":0},{"text":"His losing his marbles so early in the proceedings is totally implausible and unconvincing.  ","class":0},{"text":"And if that isn't enough of a mess of a movie for you - the picture is also marred with a constant use of studio sets and indoor exteriors.  ","class":0},{"text":"Whatever prompted such a documentary is beyond me!  ","class":0},{"text":"(very serious spoilers) this movie was a huge disappointment.  ","class":0},{"text":"there are so many problems i dont know where to start.  ","class":0},{"text":"the cast was great.  ","class":1},{"text":"steve martin delivers a really funny performance of a middle-aged, upper class, uptight white guy.  ","class":1},{"text":"add betty white and jean smart and you have a great cast - everyone played their parts really well.  ","class":1},{"text":"but the movie makes a lot of serious mistakes.  ","class":0},{"text":"first of all, there are enough racial stereotypes and racial jokes to offend everyone.  ","class":0},{"text":"the movie is littered with overt racial slurs towards the black cast members and in return the whites are depicted as morons and boobs.  ","class":0},{"text":"putting the race card aside, lets look at the major flaw in the film: they destroy latifa's character.  ","class":0},{"text":"there is no real plot.  ","class":0},{"text":"i wouldnt see this movie again for free.  ","class":0},{"text":"STEAMBOAT WILLIE is an amazingly important film to our cinema history.  ","class":1},{"text":"This second appearance of Mickey Mouse (following the silent PLANE CRAZY earlier that year) is probably his most famous film--mostly because it was so ground-breaking.  ","class":1},{"text":"While you don't yet hear Mickey speak, there are tons of sound effects and music throughout the film--something we take for granted now but which was a huge crowd pleaser in 1928.  ","class":1},{"text":"However, after seeing the short again after about 25 years, I was amazed at how timeless the film actually is.  ","class":1},{"text":"It's just adorable seeing Mickey playing \"Turkey in the Straw\" in a highly imaginative (if occasionally cruel) way.  ","class":1},{"text":"Clever and a real crowd-pleaser--this film still ranks among Mickey's best films even after 80 wonderful years.  ","class":1},{"text":"The bipolarity of the ruthless thug (one minute a ruthless killer, the next minute a Luv's diaper commercial) is completely unconvincing.  ","class":0},{"text":"I'm terribly disappointed that this film would receive so many awards and accolades, especially when there are far more deserving works of film out there.  ","class":0},{"text":"The original Body and Soul (1947) is a masterpiece.  ","class":1},{"text":"John Garfield, Ann revere, Lilli Plmer, William Conrad, Canada Lee...and filmed by one of the greatest cinematographers to ever grace the screen..James Wong Howe.  ","class":1},{"text":"I don't think there are any redeeming qualities in this remake.  ","class":0},{"text":"This may be the only bad film he ever made.  ","class":0},{"text":"So bad...well...it's just bad.  ","class":0},{"text":"This movie is a solid example of a bad plot and a very, very bad idea all the way.  ","class":0},{"text":"It's a shame to see good actors like Thomerson and James make a living in a mess like this.  ","class":0},{"text":"I thought it was bad.  ","class":0},{"text":"Both films are terrible, but to the credit of the 1986 version, it was watchable.  ","class":0},{"text":"Let's start with all the problemsthe acting, especially from the lead professor, was very, very bad.  ","class":0},{"text":"The script is a big flawed mess.  ","class":0},{"text":"The best example of how dumb the writing is when it's established that you can turn the zombie-students back into humans by removing a necklace containing a piece of the meteorite.  ","class":0},{"text":"Director Paul Matthews, who also wrote/directed the weak 1995 monster movie \"Grim\", clearly doesn't know how to pace his films.  ","class":0},{"text":"The movie is terribly boring in places.  ","class":0},{"text":"The lighting is awful.  ","class":0},{"text":"The film looks cheap and bland.  ","class":0},{"text":"One of the most disappointing aspects is the lack of notable gore.  ","class":0},{"text":"This convention never worked well in the past, and certainly doesn't work here.  ","class":0},{"text":"The visual effects were AWFUL.  ","class":0},{"text":"The CG opening sequence in space looked like it could have been created on Microsoft Slideshow for God's sake!  ","class":0},{"text":"The \"explosion\" of the Gas tanks at the end was just as awful.  ","class":0},{"text":"Okay, I like to consider myself a fair critic, so I'll give credit where credit's due--the creature effects were actually pretty cool.  ","class":1},{"text":"Gotta love those close-ups of slimy, drooling teeth!  ","class":1},{"text":"To sum the film up, \"Breeders\" is a terrible, cheaply made horror movie that should be avoided like the Ebola virus.  ","class":0},{"text":"Not recommended.  ","class":0},{"text":"He is almost unbearable to watch on screen, he has little to no charisma, and terrible comedic timing.  ","class":0},{"text":"Aside from it's terrible lead, this film has loads of other debits.  ","class":0},{"text":"I understand that it's supposed to be a cheap popcorn comedy, but that doesn't mean that it has to completely insult our intelligence, and have writing so incredibly hackneyed that it borders on offensive.  ","class":0},{"text":"Lewis Black's considerable talent is wasted here too, as he is at his most incendiary when he is unrestrained, which the PG-13 rating certainly won't allow.  ","class":0},{"text":"The film's sole bright spot was Jonah Hill (who will look almost unrecognizable to fans of the recent Superbad due to the amount of weight he lost in the interim).  ","class":1},{"text":"With the originality and freshness of the first movie now spent, this remake had little else to offer.  ","class":0},{"text":"The budget was evidently very limited.  ","class":0},{"text":"This was reflected not only in the cast, but also in the below-par script, which borrowed much from the earlier classic.  ","class":0},{"text":"However, here there was no decent acting, action or location work to balance things up.  ","class":0},{"text":"Filmiing was less expansive.  ","class":0},{"text":"It failed to convey the broad sweep of landscapes that were a great part of the original.  ","class":0},{"text":"Generally; it just lacked imagination.  ","class":0},{"text":"Not recommended.  ","class":0},{"text":"Is it possible for a movie to get any worse than this?  ","class":0},{"text":"There is no plot here to keep you going in the first place.  ","class":0},{"text":"Even when the women finally show up, there is no sign of improvement; the most expected things happen and by the time the film is over, you might be far asleep.  ","class":0},{"text":"Beware: this is not a trashy cult movie, this is trash -period!  ","class":0},{"text":"I can't believe there's even a sequel to this!  ","class":0},{"text":"Which is precisely why I am giving it such a bad review!  ","class":0},{"text":"Being a 90's child, I truly enjoyed this show and I can proudly say that I enjoyed it big time and even more than the classical WB cartoons.  ","class":1},{"text":"But \"Tiny Toons\" kept the 90's vibe and delivered one of the most popular, funny, and underrated cartoons ever created.  ","class":1},{"text":"The memories are murky but I can only say that I enjoyed every single episode and product related to the show.  ","class":1},{"text":"Easily, none other cartoon made me laugh in a tender way (before getting into dark sitcoms oriented for teenagers).  ","class":1},{"text":"The characters were all funny and had the peculiarity of not having a true lead character.  ","class":1},{"text":"Every single character was hilarious and deserved to be called a lead.  ","class":1},{"text":"Every element of this story was so over the top, excessively phony and contrived that it was painful to sit through.  ","class":0},{"text":"Her lines seem to have been WRITTEN by a fifteen year old, though they are trying oh so, so hard to sound like how a fifteen year old would really, um, you know, well... talk.  ","class":0},{"text":"Perabo has a nice energy level and is obviously very comfortable in front of a camera.  ","class":1},{"text":"There is simply no excuse for something this poorly done.  ","class":0},{"text":"I saw this movie and I thought this is a stupid movie.  ","class":0},{"text":"What is even more stupid is that who had thought an idea that there should be a volcano in Los Angeles?  ","class":0},{"text":"To be honest with you, this is unbelievable nonsense and very foolish.  ","class":0},{"text":"In conclusion, I will not bother with this movie because a volcano in Los Angeles is nothing but nonsense.  ","class":0},{"text":"The story line is just awful!  ","class":0},{"text":"It's just painful!  ","class":0},{"text":"And the accents are absolutely abysmal!  ","class":0},{"text":"There's also enough hypocrisy in this film to make me vomit.  ","class":0},{"text":"Don't waste your time watching this rubbish non-researched film.  ","class":0},{"text":"I believe that Pitch Black was done well.  ","class":1},{"text":"The characters are interesting and you want to find out more about them the longer the movie goes on, and I think people will be surprised by who does and doesn't make it.  ","class":1},{"text":"Go watch it!  ","class":1},{"text":"Omit watching this.  ","class":0},{"text":"VERY funny!  ","class":1},{"text":"My rating: just 3 out of 10.  ","class":0},{"text":"The characters are interesting and you really care for them.  ","class":1},{"text":"An instant classic, with a great soundtrack and a catchy song during the ending credits.  ","class":1},{"text":"Don't miss it.  ","class":1},{"text":"This is a masterful piece of film-making, with many themes simmering and occasionally boiling over in this warts and all study of the poet's bohemian, self-indulgent wartime years that span the aerial bombardments of London and the outward tranquillity of a Welsh coastal retreat - the borderlines between friendship, lust and love, dedication to art and experience versus practical concerns, jealousy, rivalry, cowardice and egotism versus heroism and self-sacrifice and more.  ","class":1},{"text":"A mature, subtle script that suggests and occasionally brings into dramatic focus the underlying tensions is well served by perfect performances (apart from the odd inappropriate smiling that Keira Knightley is prone to, though perhaps under direction this time as the other characters themselves often mention it).  ","class":1},{"text":"But above all the exquisite visual composition of each moment, with inventive and elegant use of close-up, camera angle and lighting, including pointillistic faux home movie footage, is a wonder and joy to behold.  ","class":1},{"text":"It's as continuously beautiful to look at as a Bertolucci, but the relationships here are more convincing and the narrative more engaging than some of that master's work.  ","class":1},{"text":"The basic premise is wasted since it is sidelined by the inexplicable focus on the documentary crew.  ","class":0},{"text":"Regardless, the film fails on most levels.  ","class":0},{"text":"Avoid at all costs.  ","class":0},{"text":"I saw this film over Christmas, and what a great film it was!  ","class":1},{"text":"I thought Errol Flynn was brilliant as Custer and has since become my favourite actor!  ","class":1},{"text":"His acting alongside Olivia De Havilland was brilliant and the ending was fantastic!  ","class":1},{"text":"I had always known that Errol Flynn was a brilliant actor as he was my dads favourite actor, and I grew up watching his films as a child.  ","class":1},{"text":"But it wasn't until I watched this film that I realised how great he actually was.  ","class":1},{"text":"I'll give this film 10 out of 10!  ","class":1},{"text":"I know that Jim O'Connor was very energetic and that nobody could be as much as him, but George was well dull.  ","class":0},{"text":"He really didn't seem to want to be hosting; his voice-overs were monotonous, didn't get involved with the guests.  ","class":0},{"text":"Lovely little thriller from Hitchcock, with lots of nice shenanigans surrounding a murdered spy, a kidnapped child, a nasty church, a foreign plot and some random taxidermists.  ","class":1},{"text":"Jimmy Stewart is as ever a great hero for Hitchcock, the story rips along to its cool climax at an embassy function, but it lacks the brooding menace of Hitchcock's black and white, low-budget original.  ","class":1},{"text":"Nevertheless yet another wonderful film from the great master's stable.  ","class":1},{"text":"I have to say that this film was excellently produced and tops the ratings as a typical sci fi film!  ","class":1},{"text":"Excellently produced by one of Sci-fi's best producers Scot Vandiver !  ","class":1},{"text":"But it is entertaining, nonetheless.  ","class":1},{"text":"It's a campy sort of film that's a joy to watch.  ","class":1},{"text":"There's barely a boring moment in the film and there are plenty of humorous parts.  ","class":1},{"text":"The cast is always entertaining as usual.  ","class":1},{"text":"Overall, a delight!  ","class":1},{"text":"This movie is so mind-bendingly awful, it couldn't have even been created.  ","class":0},{"text":"The film lacks any real scares or tension & some of the medical terminology used throughout is a bit iffy to say the least & I say that as an insulin dependant diabetic myself.  ","class":0},{"text":"The least said about the acting the better.  ","class":0},{"text":"This movie does an excellent job of revealing the complexity of the task and the incredible challenges facing South Africa.  ","class":1},{"text":"I believe every one should see this movie as I think few people outside of South Africa understand its past and what is being attempted in the Truth and Reconciliation process.  ","class":1},{"text":"Nothing short of magnificent photography/cinematography in this film.  ","class":1},{"text":"The acting is fantastic, the stories are seamlessly woven together, and the dogs are splendid............. A must rent, view, or see.  ","class":1},{"text":"Don't be afraid of subtitles........ its worth a little aversion therapy 10/10  ","class":1},{"text":"Excellent performance.  ","class":1},{"text":"There still are good actors around!  ","class":1},{"text":"Also great directing and photography.  ","class":1},{"text":"Very true to Shakespear, and a 'must' for all Shakespear fans.  ","class":1},{"text":"Macbeth (Jason Connery) moved me to tears with his final monolog (out brief candle, out)He gave the sphere of moral decay and dark forces a human face, which makes it the more interesting.  ","class":1},{"text":"Helen Baxendale is a very credible lady Macbeth who can be very cheerfull at times and sometimes she just looks like a naughty girl, but deadly in her taste for blood and evil.  ","class":1},{"text":"If you love death and decay, and Shakespears lyrics... this is the one.  ","class":1},{"text":"This is a witty and delightful adaptation of the Dr Seuss book, brilliantly animated by UPA's finest and thoroughly deserving of its Academy Award.  ","class":1},{"text":"Special mention should be made of the superb music score and sound effects, which are an integral element in helping to make this such a memorable and enjoyable cartoon.  ","class":1},{"text":"However Paul Schrader has indeed made a film \"about\" Mishima that is both superb & complex.  ","class":1},{"text":"Also notable is John Bailey's fine crisp beautifully colored cinematography and the great production design & costumes by Eiko Ishioka who went on to do the memorable costumes for Coppola's Dracula for which she received a well deserved Oscar.  ","class":1},{"text":"Even allowing for poor production values for the time (1971) and the format (some kind of mini-series), this is baaaaaad.  ","class":0},{"text":"Unless you're just out to visually \"collect\" all extant films of Austen's work, you can skip this one.  ","class":0},{"text":"If you do watch it, however, there are small consolations: The actresses playing Anne's sisters each do a wonderful job with their roles.  ","class":1},{"text":"It is not good.  ","class":0},{"text":"Speaking of the music, it is unbearably predictably and kitchy.  ","class":0},{"text":"Then the film just dropped the ball.  ","class":0},{"text":"This is a stunning movie.  ","class":1},{"text":"Raw and sublimely moving.  ","class":1},{"text":"It felt like a very gripping, intelligent stage play (but without the overly theatrical feeling one actually gets from watching people on a stage) which plays on everyone's terror of a white lie escalating to monstrous consequences.  ","class":1},{"text":"All of the main players are mesmerising.  ","class":1},{"text":"Tom Wilkinson broke my heart at the end... and everyone else's judging by the amount of fumbling for hankies and hands going up to faces among males and females alike.  ","class":1},{"text":"Julian Fellowes has triumphed again.  ","class":1},{"text":"He's a national treasure.  ","class":1},{"text":"GO AND SEE IT!  ","class":1},{"text":"This is an excellent film.  ","class":1},{"text":"The aerial scenes were well-done.  ","class":1},{"text":"It was also the right balance of war and love.  ","class":1},{"text":"The film gives meaning to the phrase, \"Never in the history of human conflict has so much been owed by so many to so few.  ","class":1},{"text":"Kris Kristoffersen is good in this movie and really makes a difference.  ","class":1},{"text":"A good film by a great director!  ","class":1},{"text":"This is definitely one of the better documentaries I have seen looking at family relationships and marriage.  ","class":1},{"text":"There are many continuity errors: one other user commented on different cars in the garage, Joe's glasses...the one that got to me the most was the fact Joe's facial hair configuration seemed to change from scene to scene.  ","class":0},{"text":"This is just a great movie.  ","class":1},{"text":"10 out of 10 stars.  ","class":1},{"text":"I can't see how this movie can be an inspiration to anyone to come out or overcome fear and rejection.  ","class":0},{"text":"It's so bad it's actually worth seeing just for that reason.  ","class":0},{"text":"Punishment Park is a brilliant piece of cinema.  ","class":1},{"text":"Shot in the Southern California desert using his patent faux documentary style, Watkins creates a film like no other.  ","class":1},{"text":"This is one of Peter Watkins most accessible films.  ","class":1},{"text":"I advise you to look out for it.  ","class":1},{"text":"You wont regret it!  ","class":1},{"text":"Highly recommended A+  ","class":1},{"text":"Well... Just if you keep thinking how bad it is.  ","class":0},{"text":"It's a mediocre, miserable, hollow, laughable and predictable piece of garbage.  ","class":0},{"text":"It's a case of 'so bad it is laughable'.  ","class":0},{"text":") very bad performance plays Angela Bennett, a computer expert who is at home all the time.  ","class":0},{"text":"It is a film about nothing, just a pretext to show ridiculous action scenes.  ","class":0},{"text":"How awful she is!  ","class":0},{"text":"But she is still a bad actress, repeating her robotic face moves in each of her pictures.  ","class":0},{"text":"The results, well, are a shame.  ","class":0},{"text":"DELETE this film from your mind!  ","class":0},{"text":"One of the worst shows of all time.  ","class":0},{"text":"The show would begin with smart ass ed comments to each other that would be totally off the wall and uncalled for.  ","class":0},{"text":"The fat computer geek was unbelievable, the bible thumper, the bad-ass girl, who are these actors???  ","class":0},{"text":"Never heard of any of them except Cole who was totally unbelievable in the part.  ","class":0},{"text":"Every time he opened his mouth you expect to hear, \"you see kids...\" Pulling the plug was a mercy killing for this horrible show.  ","class":0},{"text":"The stories were as unbelievable as the actors.  ","class":0},{"text":"Lame would be the best way to describe it.  ","class":0},{"text":"Stanwyck and Morgan are perfectly cast in what is, in many ways, a modern equivalent of Dickens' Christmas Carol in its sensibility.  ","class":1},{"text":"The success of the film depends on the casting of Sydney Greenstreet as the Alexander Yardley character.  ","class":1},{"text":"The attractive set used throughout most of the film is an eye-pleasing gem.  ","class":1},{"text":"Im big fan of RPG games too, but this movie, its a disgrace to any self-respecting RPGer there is.  ","class":0},{"text":"The lines, the cuts, the audio, everything is wrong.  ","class":0},{"text":"You can find better movies at youtube.  ","class":0},{"text":"Top line: Don't waste your time and money on this one, its as bad as it comes.  ","class":0},{"text":"A Lassie movie which should have been \"put to sleep\".... FOREVER.  ","class":0},{"text":"That's how I'd describe this painfully dreary time-waster of a film.  ","class":0},{"text":"So mediocre in every aspect that it just becomes a dull, uninteresting mess, this is one of the most forgettable movies I've seen.  ","class":0},{"text":"It isn't even an achievement as a \"so-bad-it's-good\" or \"so-bad-it's-memorable\" movie.  ","class":0},{"text":"It's an empty, hollow shell of a movie.  ","class":0},{"text":"Seriously, it's not worth wasting your, or your kid's time on.  ","class":0},{"text":"Avoid, avoid, avoid!  ","class":0},{"text":"It will drive you barking mad!  ","class":0},{"text":"The transfers are very good.  ","class":1},{"text":"Very nice and relaxing late night viewing.  ","class":1},{"text":"The movie is full of wonderful dancing (hence the title!  ","class":1},{"text":") some great music, and terrific scenery.  ","class":1},{"text":"It handles some tough issues with dignity and grace, and, of course, has (shocking spoiler here!  ","class":1},{"text":") a happy, wonderful, feel good ending!  ","class":1},{"text":"The point is the journey, a journey that touches every member of the family.  ","class":1},{"text":"It's one of the movies I need to see whenever it comes on TV...never mind the fact that I already have it memorized!  ","class":1},{"text":"Nothing new there.  ","class":0},{"text":"That was done in the second movie.  ","class":0},{"text":"The movie has almost no action scenes in it and very little comedy.  ","class":0},{"text":"The plot has more holes than a pair of fishnet stockings and the direction and editing is astonishingly ham fisted.  ","class":0},{"text":"What on earth is Irons doing in this film?  ","class":0},{"text":"I just saw this film and I recommend it.  ","class":1},{"text":"It has a very good plot, it holds your complete attention, the acting is superb, Tom Wilkinson was fantastic and Emily Watson was also very good.  ","class":1},{"text":"A very good film indeed, about great and unconditional love.  ","class":1},{"text":"Tom Wilkinson's character is a man who is not prepared for the ordeal that is about to begin, but he takes the matter in hand as the story progresses, and this great actor gives a performance that makes you feel the character's anguish and suffering.  ","class":1},{"text":"Emily Watson's character is very strong, and she has only to give a quick glance and you understand everything.  ","class":1},{"text":"Despite the pans of reviewers, I liked this movie.  ","class":1},{"text":"In fact, I liked it better than Interview With a Vampire and I liked this Lestat (Stuart Townsend) better than Cruise's attempt.  ","class":1},{"text":"Aailiyah was pretty good as Akasha, in places compelling (her first entrance and mini dance scene).  ","class":1},{"text":"I'm a big fan of this series mostly due to Anne Rice's style, sensitivities and treatments.  ","class":1},{"text":"I guess I liked the details of his dysfunction--he was believable.  ","class":1},{"text":"The football scenes at the end were perplexing.  ","class":0},{"text":"But I thought his acting was skilled.  ","class":1},{"text":"Meredith M was better than all right.  ","class":1},{"text":"A very charming film with wonderful sentiment and heart.  ","class":1},{"text":"It is rare when a film-maker takes the time to tell a worthy moral tale with care and love that doesn't fall into the trap of being overly syrupy or over indulgent.  ","class":1},{"text":"Nine out of ten for a truly lovely film.  ","class":1},{"text":"This early film from future goremeister Lucio Fulci is a very good addition to the giallo sub-genre.  ","class":1},{"text":"This is one of the best Italian thrillers of the early 70's.  ","class":1},{"text":"A standout scene.  ","class":1},{"text":"This scene is very strong and unpleasant.  ","class":0},{"text":"Technically, the film is well made with impressive camera-work, solid acting and effective music from Riz Ortolani  particularly good is a recurring unaccompanied female vocal that sounds like it's coming from a distant hill.  ","class":1},{"text":"It's still wild stuff though and is highly recommended to fans of giallo cinema.  ","class":1},{"text":"The movie was very interesting from beginning to the end.  ","class":1},{"text":"I liked the way Dustin Hoffman's character was ready to do just about everything to stay with his son.  ","class":1},{"text":"This movie is also revealing.  ","class":1},{"text":"Personally, I think it shows that people should learn to find a compromise them self without involving other people into issue.  ","class":1},{"text":"And it was boring.  ","class":0},{"text":"I am so tired of clichés that is just lazy writing, and here they come in thick and fast.  ","class":0},{"text":"PS the only scene in the movie that was cool is when the central character finds her room blown up.  ","class":1},{"text":"It's a fresh, subtle, and rather sublime effect.  ","class":1},{"text":"An Italian reviewer called this \"a small, great film,\" and that's right.  ","class":1},{"text":"All the actors give a wonderful performance, especially Jennifer Rubin as Jamie Harris, who changes from the nervous starlet in the beginning through the strange events she is part of to the cool star.  ","class":1},{"text":"You learn a lot about the real inside emotions of people in this movie, and a lot about the movie business itself.  ","class":1},{"text":"The movie in movie situations in the beginning and through the game that is played with her by the \"acting coach\" are fascinating.  ","class":1},{"text":"Also the music by Mark Snow is possibly the best score I've ever heard.  ","class":1},{"text":"You won't forget this movie!  ","class":1},{"text":"Why was this film made?  ","class":0},{"text":"The film has an ultra-cheap look to it.  ","class":0},{"text":"The result is a film that just don't look right.  ","class":0},{"text":"None of them are engaging or exciting.  ","class":0},{"text":"The plot is nonsense that doesn't interest in the slightest way or have any uniqueness to it.  ","class":0},{"text":"The Foreigner is not worth one second of your time.  ","class":0},{"text":"I saw it as a child on TV back in 1973, when it was \"The Stranger\" and I loved it.  ","class":1},{"text":"But the duet between the astronaut and his doctor at the beginning of the movie is a perfect exchange if one considers that this movie was made well into the Cold War and the astronaut's biggest fear is that he has crashed in the USSR.  ","class":1},{"text":"This movie is so awesome!  ","class":1},{"text":"I loved it, it was really scary.  ","class":1},{"text":"I love the Scream movies and all horror movies and this one ranks way up there.  ","class":1},{"text":"If you want a real scare rent this one!  ","class":1},{"text":"10/10  ","class":1},{"text":"This is an extraordinary film.  ","class":1},{"text":"As a courtroom drama, it's compelling, as an indictment on the American justice system, it's frightening.  ","class":1},{"text":"This film highlights the fundamental flaws of the legal process, that it's not about discovering guilt or innocence, but rather, is about who presents better in court.  ","class":1},{"text":"The film is well paced, understated and one of the best courtroom documentaries I've seen.  ","class":1},{"text":"This mostly routine fact-based TV drama gets a boost from the fine performance by Cole.  ","class":1},{"text":"Predictable, but not a bad watch.  ","class":1},{"text":"It was clear that she had the range and ability to pull off this part.  ","class":1},{"text":"She carries the movie well.  ","class":1},{"text":"Constantine gives everything the right intensity and seems to have a good understanding of the underlying psychological motivations.  ","class":1},{"text":"It is wonderful and inspiring to watch, and I hope that it gets released again on to video or DVD.  ","class":1},{"text":"How this piece of trash was ever released is beyond me: the acting, the story, the characters, the supposedly special effects, etc...it's ALL wrong.  ","class":0},{"text":"In fact, this stinker smells like a direct-to-video release.  ","class":0},{"text":"Avoid at ALL costs!  ","class":0},{"text":"Star Trek V The final Frontier is the worst in the series.  ","class":0},{"text":"The acting from all involved and that includes those like Shatner and Nimoy is bad and washed out and making them seem as old as they look in real life, the special effects are tacky like when Spock has to rescue Kirk on a jet pack when he falls down from a mountain.  ","class":0},{"text":"The attempts at humor were pitiful and story is so awful it dosen't bear thinking about which basically involves a Vulcan stealing the Enterprise to find god (seriously) I just didn't care about any of this film and oh not to mention Uhura does a belly dance to distract male guards.  ","class":0},{"text":"The only place good for this film is in the garbage.  ","class":0},{"text":"The worst one of the series.  ","class":0},{"text":"Editing: The editing of this film was phenomenal in my opinion.  ","class":1},{"text":"When a song could explain the emotions of the subjects better, such as when Jay Adams' unfortunate life was a subject of talk, the song Old Man by Neil Young was played, which evokes many emotions.  ","class":1},{"text":"Cinematography: The film was shot in an interesting way.  ","class":1},{"text":"Of course the footage from the 70s was grainy, but that only enhanced the film.  ","class":1},{"text":"This film offers many delights and surprises.  ","class":1},{"text":"When Achille and Philippa beautifully sing a duet from \"Don Giovanni\" that perfectly describes their situation in the movie, you appreciate the subtle layers of this excellent film.  ","class":1},{"text":"The story unfolds in 18th century Jutland and the use of period music played on period instruments is just one more fine touch.  ","class":1},{"text":"You share General Loewenhielm's exquisite joy in his partaking of the Cailles en Sarcophage even though you are just watching a movie - but you do wish for just a small sample to savor.  ","class":1},{"text":"But this understated film leaves a lasting impression.  ","class":1},{"text":"The warmth it generates is in contrast to its austere backdrop.  ","class":1},{"text":"You will leave the theater wanting to go out and dance under the stars.  ","class":1},{"text":"The acting, as you'd expect from this cast, is top notch.  ","class":1},{"text":"The characters are fleshed out surprisingly well, particularly Grimes and Blake, and all the actors deliver their sharply scripted lines with just the right amount of deadpan tongue in cheek to make the dialogue both hilarious and realistic.  ","class":1},{"text":"Angus Scrimm also turns in a good performance in a somewhat brief but memorable role as the gently menacing, violin-playing anatomist Doctor Quinn.  ","class":1},{"text":"Conclusion - I loved it.  ","class":1},{"text":"It's a long time since I was so entertained by a movie.  ","class":1},{"text":"I struggle to find anything bad to say about it.  ","class":1},{"text":"Mark my words, this is one of those cult films like Evil Dead 2 or Phantasm that people will still be discovering and falling in love with 20, 30, 40 years down the line.  ","class":1},{"text":"It's pretty surprising that this wonderful film was made in 1949, as Hollywood generally had its collective heads in the sand concerning black and white issues at that time.  ","class":1},{"text":"The film deserves strong kudos for taking this stand, for having exceptional acting from its mostly lesser-known cast and for the super-intelligent script that doesn't insult the audience or take the easy way out when it comes to white racism.  ","class":1},{"text":"Plus, with the movie's rather modest budget and fast running time, it does an amazing job!  ","class":1},{"text":"Juano Hernandez (an exceptional actor who played supporting roles in many films of the era) is a proud black man who is accused of murdering a white man in the South.  ","class":1},{"text":"Trumbull on I LOVE LUCY).  ","class":1},{"text":"See it with your kids if you have a chance--it will open up some amazing dialog about how far race relations have come in the last 50 years.  ","class":1},{"text":"See both films if you can.  ","class":1},{"text":"It was that year, however, that reminded us that Huston was still at the top of his game as evinced by his faithful adaptation of James Joyce's acclaimed novella \"The Dead.  ","class":1},{"text":"Feelings, thoughts...Gabriel's discomfort during the dance...all these intangibles leap to life and come within the viewer's grasp in Huston's portrayal.  ","class":1},{"text":"Very disappointed and wondered how it could be in the Oscar shortlist.  ","class":0},{"text":"It's very slow.  ","class":0},{"text":"Lot of holes in the plot: there's nothing about how he became the emperor; nothing about where he spend 20 years between his childhood and mature age.  ","class":0},{"text":") Don't waste your time.  ","class":0},{"text":"End of Days is one of the worst big-budget action movies I've ever seen.  ","class":0},{"text":"He surely doesn't know how to make a coherent action movie from the screenwriter of Air Force One who was only obliged to write the script just for a big sum of money.  ","class":0},{"text":"This was one of the worst films i have ever seen.  ","class":0},{"text":"I'm still trying to get over how bad it was.  ","class":0},{"text":"This movie is possibly one of the most creative works of horror ever.  ","class":1},{"text":"It has everything you could want... suspense, drama, comedy, confusing subplots, native americans, brain eating... If you're looking for the be-all, end-all of brainsucking movies, look no further.  ","class":1},{"text":"\" With great sound effects, and impressive special effects, I can't recommend this movie enough.  ","class":1},{"text":"Call me a nut, but I think this is one of the best movies ever.  ","class":1},{"text":"Great character actors Telly Savalas and Peter Boyle.  ","class":1},{"text":"1 hour 54 minutes of sheer tedium, melodrama and horrible acting, a mess of a script, and a sinking feeling of GOOD LORD, WHAT WERE THEY THINKING?  ","class":0},{"text":"Lots of holes in the script.  ","class":0},{"text":"It's like a bad two hour TV movie.  ","class":0},{"text":"Now imagine that every single one of those decisions was made wrong.  ","class":0},{"text":"The dialogue is atrocious.  ","class":0},{"text":"The acting is beyond abysmal.  ","class":0},{"text":"Everything stinks.  ","class":0},{"text":"Trouble is, the writing and directing make it impossible to establish those things that make a movie watchable, like character, story, theme and so on.  ","class":0},{"text":"Worse, there's an incredibly weak sub-plot thrown in that follows a little band of latter-day Mansonites as they go after a reporter who's working on a story on the anniversary of the killings.  ","class":0},{"text":"It's dumb and pointless, and a complete waste of time.  ","class":0},{"text":"In short, don't bother with this movie.  ","class":0},{"text":"I won't spoil it, but the ending in pretty amazing.  ","class":1},{"text":"The best scene in the movie is at the end, but I won't spoil it.  ","class":1},{"text":"If there was ever an indication of a writer and a director's ability to meld two highly volatile temperaments into a seamless union of creativity, then this is it!  ","class":1},{"text":"The result is a powerhouse achievement, made more timely now perhaps because of our culture's disturbing fascination with celebrity, and it's distorted interpretations of fame.  ","class":1},{"text":"A film not easily forgotten.  ","class":1},{"text":"But, Kevin Spacey is an excellent, verbal tsunami as Buddy Ackerman  and totally believable because he is a great actor.  ","class":1},{"text":"The scripting of the subtle comedy is unmatched by any movie in recent years.  ","class":1},{"text":"The characters are interesting, even if a bit predictable.  ","class":1},{"text":"Highly recommended for all ages, although the younger set will probably not appreciate some of the more subtle references, they will certainly appreciate one galley scene in particular!  ","class":1},{"text":"Great movie!  ","class":1},{"text":"Also the story and acting were weak.  ","class":0},{"text":"At around 4 pm I bought it, at around 8pm I started to watch, at around 8.15pm I fast forwarded the remaining film to see if there was anything left watchable for a human being with a brain... but there wasn't.  ","class":0},{"text":"Either way, it sucks.  ","class":0},{"text":"The script is horrendously stupid.  ","class":0},{"text":"The story starts too fast with absolutely no suspense or build-up in the slightest.  ","class":0},{"text":"Everything Captain Howdy says is either laughable or just plain stupid.  ","class":0},{"text":"What the hell kind of crap is that?!  ","class":0},{"text":"Then, there's the plot holes.  ","class":0},{"text":"You could drive a semi truck into these holes!  ","class":0},{"text":"Linda Cardellini is the only thing good in this film.  ","class":1},{"text":"She's poised and amazing.  ","class":1},{"text":"Dee Snider just plain sucks.  ","class":0},{"text":"He can't act (one of the least scary villains I have ever seen), he can't write (did he write this damn movie in his sleep?  ","class":0},{"text":"I was bored throughout the whole damn thing.  ","class":0},{"text":"The acting sucks, the music sucks, the script sucks, the pacing sucks, the special FX suck, the directing sucks... basically, this movie sucks.  ","class":0},{"text":"This film tries to be a serious and sophisticated thriller/horror flick and it fails miserably.  ","class":0},{"text":"This is probably one of the least effective and utterly unoriginal films I have ever seen in my entire life.  ","class":0},{"text":"A piece of cinematic garbage captured on celluloid.  ","class":0},{"text":"Avoid at any and all costs.  ","class":0},{"text":"At any rate this film stinks, its not funny, and Fulci should have stayed with giallo and supernatural zombie movies.  ","class":0},{"text":"Avoid this film at all costs.  ","class":0},{"text":"I don't know what happened in Season Five, what a mess.  ","class":0},{"text":"The only consistent thread holding the series together were the amazing performances of Leni Parker and Anita LaSelva as the two Taelons in quiet idealogical conflict.  ","class":0},{"text":"Now this is a movie I really dislike.  ","class":0},{"text":"It's one of the most boring Horror movies from the 90's mainly because it starts slow and centers in a boring atmosphere.  ","class":0},{"text":"The puppets look really cheesy , not in a good way like in the Puppet Master 80's flicks.  ","class":0},{"text":"The story is lame, not interesting and NEVER really explains the sinister origins of the puppets.  ","class":0},{"text":"There aren't death scenes like in previous movies and the f/x are terrible.  ","class":0},{"text":"I felt asleep the first time I watched it, so I can recommend it for insomniacs.  ","class":0},{"text":"The fact is, this film is a wonderful, heartwarming tale about two people chasing their dreams.  ","class":1},{"text":"The best part about \"Nurse Betty\" is it's unpredictability.  ","class":1},{"text":"Director Neil LaBute uses brutal violence to seperate dreams from reality, and along with the touching drama, and hilarious comedy, you can never tell what is going to happen next.  ","class":1},{"text":"Otherwise, don't even waste your time on this.  ","class":0},{"text":"This one just fails to create any real suspense.  ","class":0},{"text":"As for the killer, don't expect anything original or even remotely frightening.  ","class":0},{"text":"There is, however, some pretty good acting (at least, for this type of film).  ","class":1},{"text":"I'm so sorry but I really can't recommend it to anyone.  ","class":0},{"text":"One of the most boring,pointless movies I have ever seen.  ","class":0},{"text":"The secondary plot line is incomprehensible and its relation to the primary plot line is mystifying.  ","class":0},{"text":"Hated it.  ","class":0},{"text":"This is one of the worst Sandra Bullock movie since Speed 2 But not quite that bad.  ","class":0},{"text":"I don't understand how this garbage got on the shelves of the movie store, it's not even a real movie!  ","class":0},{"text":"I highly doubt that anyone could ever like this trash.  ","class":0},{"text":"This is not movie-making.  ","class":0},{"text":"The acting is like watching wooden puppets moving around and reading from a book, that's how bad it is.  ","class":0},{"text":"So I am here to warn you--DO NOT RENT THIS MOVIE, it is the dumbest thing you have never seen!  ","class":0},{"text":"I saw this short film on HBO the other day and absolutely loved it.  ","class":1},{"text":"I didn't realize how wonderful the short really is until the last two scenes.  ","class":1},{"text":"Excellent short film.  ","class":1},{"text":"Hopefully, the director James Cox can turn the short into a feature length film with the same cast, or win us over with a whole new film.  ","class":1},{"text":"I agree with Jessica, this movie is pretty bad.  ","class":0},{"text":"Characters are one-dimensional, even the good guys and especially the bad guys.  ","class":0},{"text":"The story line is totally predictable.  ","class":0},{"text":"Not much dialogue, not much music, the whole film was shot as elaborately and aesthetically like a sculpture.  ","class":1},{"text":"I've seen soap operas more intelligent than this movie.  ","class":0},{"text":"Bad characters, bad story and bad acting.  ","class":0},{"text":"Really awful.  ","class":0},{"text":"Not easy to watch.  ","class":0},{"text":"Funny, clever, hip - just like Pray's previous film, Hype!  ","class":1},{"text":"It was a long time that i didn't see a so charismatic actor on screen.  ","class":1},{"text":"Paolo Sorrentino has written a wonderful story about loneliness and Tony has built one of the most unforgettable characters seen in movies in recent years.  ","class":1},{"text":"The movie is not completely perfect but 'Titta Di Girolamo' will stay with you for a long time after the vision of the movie.  ","class":1},{"text":"I rate this movie 9/10.  ","class":1},{"text":"I do not know if this was Emilio Estevez's directorial debut, but the pacing, the interplay and development of the characters as well as some clever camera work surrounding the character Estevez plays all suggest a natural eye.  ","class":1},{"text":"The interplay between Martin and Emilio contains the same wonderful chemistry we saw in Wall Street with Martin and Charlie.  ","class":1},{"text":"Kathy Bates is wonderful in her characters subtle desperation and escapism; a variation on her character in \"At Play In The Fields Of The Lord\".  ","class":1},{"text":"For readers who have already seen one of Miyazaki's films: he is still in top form and made another worthwhile experience.  ","class":1},{"text":"It never condescends, all the characters have good genuine hearts and believable problems.  ","class":1},{"text":"The two main characters may be two of the most believable children I ever saw put on screen.  ","class":1},{"text":"They are so easy to love, but even more easy to identify with.  ","class":1},{"text":"This movie is great--especially if you enjoy visual arts.  ","class":1},{"text":"The scenery that the two daughters paint and photograph are beautiful.  ","class":1},{"text":"The story is also both funny and poignant at times.  ","class":1},{"text":"People who like European films and \"art movies\" will like this movie.  ","class":1},{"text":"This is truly an art movie--it actually has a lot of art in it.  ","class":1},{"text":"Go rent it.  ","class":1},{"text":"However, after finally watching this film, I realized that not only had I had a closed mind to the brilliance it depicts, I also found myself watching it over and over again.  ","class":1},{"text":"It's the one movie that never ceases to interest me, simply because it keeps me alert, as I try to attempt to decipher it's meanings.  ","class":1},{"text":"Brilliance indeed.  ","class":1},{"text":"But if you liked movies like The Matrix (and better yet, their sequels) I think you'll appreciate the thought provoking, mindblowing experience this film will give you.  ","class":1},{"text":"Think of the film being like a dream.  ","class":1},{"text":"Simply beautiful.  ","class":1},{"text":"Both Rickman and Stowe play their roles to the hilt in this tale of a childrens' book writer who-- maybe?-- has written a subversive tract.  ","class":1},{"text":"It's a gloriously fun, fast paced and fairly accurate portrayal of the night of a raver.  ","class":1},{"text":"It presents a idyllic yet serious portrayal of the ups and downs of the characters lives.  ","class":1},{"text":"Just whatever you do, avoid \"Groove\" as its the antithesis of all that is good about Human Traffic.  ","class":0},{"text":"It's too bad that everyone else involved didn't share Crowe's level of dedication to quality, for if they did, we'd have a far better film on our hands than this sub-par mess.  ","class":0},{"text":"The movie seemed a little slow at first.  ","class":0},{"text":"But it picked up speed and got right to the point.  ","class":1},{"text":"It showed exactly how the government and the scientist argued for humanity and the reasons of the \"gadget\".  ","class":1},{"text":"I enjoyed it.  ","class":1},{"text":"I have recommended it to friends.  ","class":1},{"text":"I was particularly pleased with the acting ability of Dwight Schultz.  ","class":1},{"text":"Both actors truly understand and become their particular character, delivering a convincing, sincere performance.  ","class":1},{"text":"Their on-screen chemistry, critical to the entire film, is genuine.  ","class":1},{"text":"The film's dialogue is natural, real to life.  ","class":1},{"text":"The writer, Gorman Bechard, undoubtedly did his homework because all references are industry and character-age appropriate.  ","class":1},{"text":"The incredible soundtrack truly captures the essence of the film.  ","class":1},{"text":"Each track commands sentiment, actually contributing to the scenes and characters.  ","class":1},{"text":"Definitely worth seeing it's the sort of thought provoking film that forces you to question your own threshold of loneliness.  ","class":1},{"text":"Hayao Miyazaki's latest and eighth film for Studio Ghibili, \"Gake No Ue No Ponyo\" (Ponyo on the Cliff by the Sea) is a wonderfully fun and imaginative look at childhood.  ","class":1},{"text":"At a time when it seems that film animation has been dominated by Disney/Pixar's CGI masterpieces, it is both refreshing and comforting to know that Miyazaki is still relying on traditional hand-drawn animation to tell his charming and enchanting stories.  ","class":1},{"text":"Enough can not be said of the remarkable animation in this film.  ","class":1},{"text":"The art style has the appearance of crayon/pencil drawings and is wonderfully colorful and fanciful.  ","class":1},{"text":"If you act in such a film, you should be glad that you're gonna drift away from earth as far as possible!  ","class":0},{"text":"This one wants to surf on the small wave of space movies in 1998 (Deep Impact and Armageddon), and this one fails everywhere.  ","class":0},{"text":"If you haven't choked in your own vomit by the end (by all the cheap drama and worthless dialogue) you've must have bored yourself to death with this waste of time.  ","class":0},{"text":"Still, it makes up for all of this with a super ending that depicts a great sea vessel being taken out by the mighty frost.  ","class":1},{"text":"Just consider the excellent story, solid acting and look of the film as added bonuses.  ","class":1},{"text":"Instead, we got a bore fest about a whiny, spoiled brat babysitting.  ","class":0},{"text":"Then I watched it again two Sundays ago (March 20th, 2005) and I began to really enjoy it and this time I taped the entire thing.  ","class":1},{"text":"It is a very well acted and done TV Movie.  ","class":1},{"text":"Judith Light is one of my favorite actresses and I think she does a superb job in this film!  ","class":1},{"text":"I keep watching it over and over.  ","class":1},{"text":"It's a sad movie, but very good.  ","class":1},{"text":"If you have not seen this movie, I definitely recommend it!  ","class":1},{"text":"She is as lovely as usual, this cutie!  ","class":1},{"text":"Still it's quite interesting and entertaining to follow.  ","class":1},{"text":";) Recommend with confidence!  ","class":1},{"text":"This movie is well-balanced with comedy and drama and I thoroughly enjoyed myself.  ","class":1},{"text":"It was a riot to see Hugo Weaving play a sex-obsessed gay real estate salesman who uses his clients' houses for his trysts with the flaming Darren (Tom Hollander).  ","class":1},{"text":":) Anyway, the plot flowed smoothly and the male-bonding scenes were a hoot.  ","class":1},{"text":"The opening sequence of this gem is a classic, and the cat n mouse games that follow are a delight to watch.  ","class":1},{"text":"Fans of the genre will be in heaven.  ","class":1},{"text":"Lange had become a great actress.  ","class":1},{"text":"It looked like a wonderful story.  ","class":1},{"text":"I never walked out of a movie faster.  ","class":0},{"text":"I just got bored watching Jessice Lange take her clothes off!  ","class":0},{"text":"Unfortunately, any virtue in this film's production work was lost on a regrettable script.  ","class":0},{"text":"In a word, it is embarrassing.  ","class":0},{"text":"Exceptionally bad!  ","class":0},{"text":"All in all its an insult to one's intelligence and a huge waste of money.  ","class":0},{"text":"","class":null}]